defmodule CA.L3.Orgs do
  @moduledoc """
  Level 3: CA.L3.Orgs Security Profile
  """

  def org_name, do: "Державна судова адміністрація України"
  def system_desc, do: "Єдина судова інформаційно-комунікаційна система (ЄСІКС)"
  def system_name, do: "Органи Суддівського Врядування"

  def controls do
    [
  %{
    id: "AC",
    name: "УПРАВЛІННЯ ДОСТУПОМ (AC)",
    text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
    subcontrols: [
      %{
        id: "AC-1",
        name: "ПОЛІТИКА ТА ПРОЦЕДУРИ УПРАВЛІННЯ ДОСТУПОМ (AC-1)",
        text: "За політику та процедури управління доступом в системі ЄСІКС відповідає підсистема IAM/PKI (Identity and Access Management / Public Key Infrastructure), яка керує обліковими записами, ролями та доступом користувачів згідно з вимогами та політиками ЄСІКС.",
        parameters: [
          {:ac_1_odp_01,
           "Визначено персонал або ролі, на які поширюється політика контролю доступу",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ac_1_odp_02,
           "Визначено персонал або ролі, на які поширюються процедури контролю доступу",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ac_1_odp_03,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {рівень організації; рівень місії/бізнес-процесу; рівень системи}",
           [type: :string, default: nil]},
          {:ac_1_odp_04,
           "Визначено посадову особу, яка керуватиме політикою та процедурами контролю доступу",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ac_1_odp_05,
           "Визначено частоту, з якою переглядається та оновлюється поточна політика контролю доступу",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ac_1_odp_06,
           "Визначено події, які вимагають перегляду та оновлення поточної політики контролю доступу",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ac_1_odp_07,
           "Визначено частоту, з якою переглядаються та оновлюються поточні процедури контролю доступу",
           [type: :integer, default: 30]}
        ]
      },
      %{
        id: "AC-2",
        name: "УПРАВЛІННЯ ОБЛІКОВИМИ ЗАПИСАМИ (AC-2)",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          %{default: true, name: :account_management, type: :boolean}
        ]
      },
      %{
        id: "AC-2(3)",
        name: "УПРАВЛІННЯ ОБЛІКОВИМИ ЗАПИСАМИ - ДЕАКТИВАЦІЯ ОБЛІКОВИХ ЗАПИСІВ (AC-2(3))",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_2_3_b,
           "Облікові записи деактивуються протягом часового періоду, коли облікові записи більше не пов'язані з користувачем або фізичною особою",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ac_2_3_d,
           "Облікові записи відключено протягом часового періоду, коли облікові записи порушують політику організації; облікові записи деактивуються протягом , якщо вони були неактивними протягом ",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ac_2_3_odp_01,
           "Визначено період часу, протягом якого необхідно деактивувати облікові записи",
           [type: :integer, default: 30]},
          {:ac_2_3_odp_02,
           "Визначено період часу неактивності, після закінчення якого облікові записи будуть деактивовані; AC-02(03)(a) облікові записи деактивуються протягом часового періоду, коли термін дії облікових записів минув",
           [type: :list, default: ["login", "logout", "failed_attempt"]]}
        ]
      },
      %{
        id: "AC-2(5)",
        name: "УПРАВЛІННЯ ОБЛІКОВИМИ ЗАПИСАМИ - ВИХІД ІЗ СИСТЕМИ ЗА ВІДСУТНОСТІ АКТИВНОСТІ (AC-2(5))",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_2_5_01,
           "Користувачі повинні виходити з системи, коли період очікуваної бездіяльності або опис часу, коли потрібно вийти з системи",
           [type: :integer, default: 30]},
          {:ac_2_5_odp,
           "Визначено часовий період очікуваної бездіяльності або опис, коли потрібно вийти з системи",
           [type: :integer, default: 30]}
        ]
      },
      %{
        id: "AC-2(13)",
        name: "УПРАВЛІННЯ ОБЛІКОВИМИ ЗАПИСАМИ - ДЕАКТИВАЦІЯ ОБЛІКОВИХ ЗАПИСІВ ОСІБ З ВИСОКИМ РІВНЕМ РИЗИКУ (AC-2(13))",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_2_13_01,
           "Облікові записи користувачів деактивуються протягом періоду часу з моменту виявлення значних ризиків",
           [type: :integer, default: 30]},
          {:ac_2_13_odp_01,
           "Визначено період часу, протягом якого необхідно деактивувати облікові записи фізичних осіб, які становлять значний ризик",
           [type: :integer, default: 30]},
          {:ac_2_13_odp_02,
           "Визначено значні ризики, що призводять до деактивації облікових записів",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AC-3",
        name: "ЗАБЕЗПЕЧЕННЯ ДОСТУПУ (AC-3)",
        text: "Усі запити до ресурсів системи примусово проходять через Policy Decision Point (PDP) модуля `abac`. Прямий доступ до даних в обхід механізмів авторизації заборонено архітектурно.",
        parameters: [
          %{default: true, name: :access_enforcement, type: :boolean}
        ]
      },
      %{
        id: "AC-4",
        name: "УПРАВЛІННЯ ІНФОРМАЦІЙНИМИ ПОТОКАМИ (AC-4)",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_4_01,
           "Затверджені повноваження застосовуються для контролю потоку інформації всередині системи та між підключеними системами на основі політики управління інформаційними потоками",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ac_4_odp,
           "Визначено політики управління інформаційними потоками всередині системи та між підключеними системами",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]}
        ]
      },
      %{
        id: "AC-5",
        name: "РОЗМЕЖУВАННЯ ОБОВ'ЯЗКІВ (AC-5)",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_5_odp,
           "Визначено обов'язки осіб, які потребують розмежування; AC-05[a] обов'язки осіб визначені та задокументовані; AC-05[b] визначено права авторизації доступу до системи для підтримки розмежування обов'язків",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AC-6",
        name: "МІНІМІЗАЦІЯ ПОВНОВАЖЕНЬ (AC-6)",
        text: "Профілі безпеки і ролі конфігуруються таким чином, що користувачам надаються лише ті привілеї, які необхідні для виконання їхніх посадових обов'язків. Механізм дозволів `abac` працює за принципом 'Default-Deny'.",
        parameters: [%{default: true, name: :least_privilege, type: :boolean}]
      },
      %{
        id: "AC-6(1)",
        name: "МІНІМІЗАЦІЯ ПОВНОВАЖЕНЬ - АВТОРИЗОВАНИЙ ДОСТУП ДО ФУНКЦІЙ БЕЗПЕКИ (AC-6(1))",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_6_1_a_01,
           "Авторизовано доступ для осіб та ролей до функцій безпеки (розгорнуті на апаратному забезпеченні)",
           [type: :string, default: nil]},
          {:ac_6_1_a_02,
           "Авторизовано доступ для осіб та ролей до функцій безпеки (роз- горнуті на програмному забезпеченні)",
           [type: :string, default: nil]},
          {:ac_6_1_a_03,
           "Авторизовано доступ для осіб та ролей до функцій безпеки (розгорнуті на мікропрограмному забезпеченні)",
           [type: :string, default: nil]},
          {:ac_6_1_b,
           "Авторизовано доступ для осіб та ролей до інформації",
           [type: :string, default: nil]},
          {:ac_6_1_odp_01,
           "Визначені особи або ролі з авторизованим доступом до функцій безпеки та інформації, що має відношення до безпеки",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ac_6_1_odp_02,
           "Визначені функції безпеки (розгорнуті в апаратному забезпеченні) для авторизованого доступу",
           [type: :string, default: nil]},
          {:ac_6_1_odp_03,
           "Визначені функції безпеки (розгорнуті в програмному забезпеченні) для авторизованого доступу",
           [type: :string, default: nil]},
          {:ac_6_1_odp_04,
           "Визначені функції безпеки (розгорнуті в мікропрограмному забезпеченні) для авторизованого доступу",
           [type: :string, default: nil]},
          {:ac_6_1_odp_05,
           "Визначено інформацію, важливу для забезпечення безпеки, для авторизованого доступу",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AC-6(2)",
        name: "МІНІМІЗАЦІЯ ПОВНОВАЖЕНЬ - НЕПРИВІЛЕЙОВАНИЙ ДОСТУП ДО НЕЗАХИЩЕНИХ ФУНКЦІЙ (AC-6(2))",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_6_2_01,
           "Користувачі облікових записів (або ролей) системи з доступом до функцій безпеки або інформації, що стосується безпеки, повинні використовувати непривілейовані облікові записи або ролі під час доступу до незахищених функцій",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ac_6_2_odp,
           "Визначені функції безпеки або інформація, що стосується безпеки",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AC-6(5)",
        name: "МІНІМІЗАЦІЯ ПОВНОВАЖЕНЬ - ПРИВІЛЕЙОВАНІ ОБЛІКОВІ ЗАПИСИ (AC-6(5))",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_6_5_01,
           "Привілейовані облікові записи в системі обмежено персонал або ролі",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ac_6_5_odp,
           "Визначено персонал або ролі, яким мають бути обмежені привілейовані облікові записи в системі",
           [type: :list, default: ["admin", "security_officer"]]}
        ]
      },
      %{
        id: "AC-6(7)",
        name: "МІНІМІЗАЦІЯ ПОВНОВАЖЕНЬ - ПЕРЕГЛЯД ПОВНОВАЖЕНЬ КОРИСТУВАЧА (AC-6(7))",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_6_7_a,
           "Повноваження, призначені ролям і класам, переглядаються з частотою для перевірки необхідності таких повноважень",
           [type: :integer, default: 30]},
          {:ac_6_7_b,
           "Привілеї перепризначаються або знімаються, якщо це необхідно, для правильного відображення місії організації та потреб",
           [type: :string, default: nil]},
          {:ac_6_7_odp_01,
           "Визначено частоту перегляду повноважень, призначених ролям або класам користувачів",
           [type: :integer, default: 30]},
          {:ac_6_7_odp_02,
           "Визначено ролі або класи користувачів, яким призначено повноваження ",
           [type: :list, default: ["admin", "security_officer"]]}
        ]
      },
      %{
        id: "AC-6(9)",
        name: "МІНІМІЗАЦІЯ ПОВНОВАЖЕНЬ - АУДИТ ВИКОРИСТАННЯ ПРИВІЛЕЙОВАНИХ ФУНКЦІЙ (AC-6(9))",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_6_9_01,
           "Проводиться аудит виконання привілейованих функцій",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AC-6(10)",
        name: "МІНІМІЗАЦІЯ ПОВНОВАЖЕНЬ - ЗАБОРОНА НЕПРИВІЛЕЙОВАНИМ КОРИСТУВАЧАМ ВИКОНУВАТИ ПРИВІЛЕЙОВАНІ ФУНКЦІЇ (AC-6(10))",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_6_10_01,
           "МІНІМІЗАЦІЯ ПОВНОВАЖЕНЬ - ЗАБОРОНА НЕПРИВІЛЕЙОВАНИМ КОРИСТУВАЧАМ ВИКОНУВАТИ ПРИВІЛЕЙОВАНІ ФУНКЦІЇ МЕТА ОЦІНКИ: Визначити, чи:",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AC-7",
        name: "НЕВДАЛІ СПРОБИ ВХОДУ В СИСТЕМУ (AC-7)",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_7_a,
           "Застосовано обмеження на кількість послідовних неуспішних спроб входу користувача протягом періоду часу",
           [type: :integer, default: 30]},
          {:ac_7_odp_01,
           "Визначається кількість послідовних неуспішних спроб входу користувача, дозволених протягом певного періоду часу",
           [type: :integer, default: 30]},
          {:ac_7_odp_02,
           "Визначено період часу, яким обмежується кількість послідовних неуспішних спроб входу користувача",
           [type: :integer, default: 30]},
          {:ac_7_odp_03,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {заблокувати обліковий запис або вузол на період часу; заблокувати обліковий запис або вузол до зняття адміністратором; затримати наступний запит на вхід за алгоритмом затримки; повідомити системного адміністратора; виконати іншу дію}",
           [type: :string, default: "AES-256-GCM"]},
          {:ac_7_odp_04,
           "Період часу, на який буде заблоковано обліковий запис або вузол (якщо вибрано)",
           [type: :integer, default: 30]},
          {:ac_7_odp_05,
           "Визначено алгоритм затримки наступного запиту на вхід (якщо вибрано)",
           [type: :string, default: "AES-256-GCM"]},
          {:ac_7_odp_06,
           "Інша дія, яка буде виконана після перевищення максимальної кількості невдалих спроб (якщо вибрано)",
           [type: :integer, default: 3]}
        ]
      },
      %{
        id: "AC-7(2)",
        name: "НЕВДАЛІ СПРОБИ ВХОДУ В СИСТЕМУ - ОЧИЩЕННЯ АБО СТИРАННЯ МОБІЛЬНОГО ПРИСТРОЮ (AC-7(2))",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_7_2_01,
           "Інформація очищується або стирається з мобільних пристроїв на основі вимог або методів очищення або стирання після <AC-07(02)_ODP[03 кількість> послідовних, невдалих спроб входу на пристрій",
           [type: :integer, default: 3]},
          {:ac_7_2_odp_01,
           "Визначено мобільні пристрої, які підлягають очищенню або стиранню інформації",
           [type: :string, default: nil]},
          {:ac_7_2_odp_02,
           "Визначено вимоги та методи очищення чи стирання інформації з мобільних пристроїв",
           [type: :string, default: nil]},
          {:ac_7_2_odp_03,
           "Визначається кількість послідовних невдалих спроб входу в систему до того, як інформація буде очищена або стерта з мобільних пристроїв",
           [type: :integer, default: 3]}
        ]
      },
      %{
        id: "AC-8",
        name: "ПОПЕРЕДЖЕННЯ ПРО ВИКОРИСТАННЯ СИСТЕМИ (AC-8)",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_8_c_02,
           "Визначається сповіщення або банер про використання системи, який система буде показувати користувачам перед наданням доступу до системи; визначено умови використання системи, які система відображатиме перед наданням подальшого доступу; повідомлення про використання системи відображається користувачам перед наданням доступу до системи, яке містить повідомлення про конфіденційність і безпеку, що відповідають чинним законам, нормативним документам, наказам, директивам, політикам, правилам, стандартам і керівним принципам; у повідомленні про використання системи зазначено, що користувачі отримують доступ до урядової системи; у повідомленні про використання системи зазначено, що використання системи може контролюватися, реєструватися та підлягати аудиту; у повідомленні про використання системи зазначено, що несанкціоноване використання системи заборонено і тягне за собою кримінальну та цивільну відповідальність; у повідомленні про використання системи зазначено, що використання системи означає згоду на моніторинг і запис дій; сповіщення або банер залишається на екрані до тих пір, поки користувачі не визнають умови використання та не приймуть явні дії для входу в систему або подальшого доступу до неї; для загальнодоступних систем інформація про використання системи умови відображається перед наданням подальшого доступу до загальнодоступної системи; для загальнодоступних систем відображаються будь-які посилання на моніторинг, запис або аудит, які узгоджуються з положеннями про конфіденційність таких систем, що зазвичай забороняють ці види діяльності; для загальнодоступних систем додається опис авторизованого використання системи",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]}
        ]
      },
      %{
        id: "AC-11",
        name: "БЛОКУВАННЯ ПРИСТРОЮ (AC-11)",
        text: "Сеанс користувача автоматично блокується системою (`synrc/n2o` session expiry) після визначеного періоду бездіяльності, вимагаючи повторної автентифікації.",
        parameters: [
          %{default: 900, name: :session_lock_timeout, type: :integer}
        ]
      },
      %{
        id: "AC-11(1)",
        name: "БЛОКУВАННЯ ПРИСТРОЮ - ПРИХОВАНІ ДИСПЛЕЇ (AC-11(1))",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_11_1_01,
           "Система приховує (через блокування сеансу) інформацію, попередньо видиму на дисплеї, загальнодоступним зображенням",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AC-12",
        name: "Припинення сеансу (AC-12)",
        text: "Користувач може ініціювати завершення сеансу (logout). Крім того, система примусово завершує сеанси при досягненні максимального часу життя токена або зміни контексту безпеки.",
        parameters: [
          %{default: true, name: :session_termination, type: :boolean}
        ]
      },
      %{
        id: "AC-15",
        name: "АВТОМАТИЗОВАНЕ МАРКУВАННЯ (AC-15)",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_15_01,
           "АВТОМАТИЗОВАНЕ МАРКУВАННЯ [Вилучено: включено до MP-03]",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AC-16",
        name: "АТРИБУТИ БЕЗПЕКИ ТА ПРИВАТНОСТІ (AC-16)",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_16_c_02,
           "Визначено типи атрибутів безпеки, які мають бути пов'язані зі значеннями атрибутів безпеки для інформації, що зберігається, обробляється та/або передається; визначено значення атрибутів конфіденційності для типів атрибутів конфіденційності; визначено системи, для яких мають бути встановлені дозволені атрибути безпеки; визначено системи, для яких мають бути встановлені дозволені атрибути конфіденційності; визначено атрибути безпеки, визначені як частина AC-16(a), які дозволені для систем; визначено атрибути конфіденційності, визначені як частина AC-16(a), які дозволені для систем; визначено значення атрибутів або діапазони для встановлених атрибутів; визначено частоту, з якою слід переглядати атрибути безпеки на предмет відповідності; визначено частоту, з якою слід переглядати атрибути конфіденційності на предмет відповідності; надано засоби для асоціювання типів атрибутів безпеки зі значеннями атрибутів безпеки для інформації, що зберігається, обробляється та/або передається надано засоби для асоціювання типів атрибутів конфіденційності зі значеннями атрибутів конфіденційності для інформації, що зберігається, обробляється та/або передається виникають зв’язки з атрибутами; зв’язки атрибутів зберігаються разом з інформацією; на основі атрибутів, визначених у AC-16_ODP[01] для систем, встановлюються наступні дозволені атрибути безпеки: атрибути безпеки; на основі атрибутів, визначених у AC-16_ODP[02] для систем, встановлюються наступні дозволені атрибути приватності: атрибути конфіденційності ; AC-16(d)",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ac_16_f_02,
           "Визначено наступні допустимі значення або діапазони атрибутів для кожного з встановлених атрибутів: значення або діапазони атрибутів; проводиться аудит змін до атрибутів; атрибути безпеки перевіряються на відповідність частота; атрибути конфіденційності перевіряються на відповідність частота",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ac_16_odp_02,
           "Визначено типи атрибутів конфіденційності, які мають бути пов'язані зі значеннями атрибутів конфіденційності для інформації, що зберігається, обробляється та/або передається",
           [type: :string, default: nil]},
          {:ac_16_odp_03,
           "Визначено значення атрибутів безпеки для типів атрибутів безпеки",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AC-17",
        name: "ВІДДАЛЕНИЙ ДОСТУП (AC-17)",
        text: "Віддалений доступ до системи керується додатковими політиками (наприклад, перевірка IP-адреси, VPN, mTLS), які інтегруються з `synrc/ca` та `abac` для забезпечення безпеки доступу за межами захищеного периметра.",
        parameters: [
          %{default: true, name: :remote_access_control, type: :boolean}
        ]
      },
      %{
        id: "AC-17(3)",
        name: "ВІДДАЛЕНИЙ ДОСТУП - КЕРОВАНІ ТОЧКИ КОНТРОЛЮ ДОСТУПУ (AC-17(3))",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_17_3_01,
           "Віддалений доступ маршрутизується через авторизовані та керовані точки контролю доступу до мережі",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AC-17(4)",
        name: "ВІДДАЛЕНИЙ ДОСТУП - ПРИВІЛЕЙОВАНІ КОМАНДИ ТА ДОСТУП (AC-17(4))",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_17_4_a_01,
           "Виконання привілейованих команд за допомогою віддаленого доступу дозволено лише для наступних потреб: потреби ",
           [type: :string, default: nil]},
          {:ac_17_4_a_02,
           "Доступ до інформації, важливої для безпеки, за допомогою віддаленого доступу дозволяється лише для наступних потреб: потреби ",
           [type: :string, default: nil]},
          {:ac_17_4_b,
           "Обґрунтування віддаленого доступу задокументовано в плані захисту інформації",
           [type: :string, default: nil]},
          {:ac_17_4_odp_01,
           "Визначено потреби, що потребують виконання привілейованих команд за допомогою віддаленого доступу; AC-17(04)_ODP[02] визначено потреби, що вимагають доступу до інформації, що стосується безпеки, за допомогою віддаленого доступу",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AC-18",
        name: "БЕЗДРОТОВИЙ ДОСТУП (AC-18)",
        text: "a. Установити обмеження на використання, вимоги до конфігурації/підключення та рекомендації щодо здійснення бездротового доступу.\nb. Авторизувати бездротовий доступ до системи, перш ніж будуть дозволені такі підключення.",
        parameters: [
          {:ac_18_a_01,
           "Встановлено обмеження на використання щодо здійснення бездротового доступу",
           [type: :string, default: nil]},
          {:ac_18_a_02,
           "Встановлено вимоги до конфігурації або підключення щодо здійснення бездротового доступу",
           [type: :string, default: nil]},
          {:ac_18_a_03, "Встановлено доступу",
           [type: :string, default: nil]},
          {:ac_18_b,
           "Авторизується бездротовий доступ до системи перед тим, як дозволяти такі з'єднання. рекомендації щодо здійснення бездротового",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AC-18(1)",
        name: "БЕЗДРОТОВИЙ ДОСТУП - АВТЕНТИФІКАЦІЯ ТА ШИФРУВАННЯ (AC-18(1))",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_18_1_02,
           "Бездротовий доступ до системи захищений за допомогою шифрування",
           [type: :string, default: "AES-256-GCM"]}
        ]
      },
      %{
        id: "AC-18(3)",
        name: "БЕЗДРОТОВИЙ ДОСТУП - ВІДКЛЮЧЕННЯ БЕЗДРОТОВОЇ МЕРЕЖІ (AC-18(3))",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_18_3_01,
           "Відключено, у разі відсутності необхідності у використанні, вбудовані в компоненти системи можливості бездротових мереж до їх виклику та розгортання",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AC-19",
        name: "КОНТРОЛЬ ДОСТУПУ ДЛЯ МОБІЛЬНИХ ПРИСТРОЇВ (AC-19)",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_19_a_01,
           "Встановлено вимоги до конфігурації мобільних пристроїв, що контролюються організацією, в тому числі, коли такі пристрої перебувають за межами контрольованої території",
           [type: :string, default: nil]},
          {:ac_19_a_02,
           "Встановлюються вимоги до підключення для мобільних пристроїв, що контролюються організацією, в тому числі, коли такі пристрої знаходяться за межами контрольованої території",
           [type: :string, default: nil]},
          {:ac_19_a_03,
           "Розроблено рекомендації щодо впровадження для мобільних пристроїв, які контролюються організацією, в тому числі, коли такі пристрої перебувають за межами контрольованої території",
           [type: :string, default: nil]},
          {:ac_19_b,
           "Авторизовано підключення мобільних пристроїв до систем організації",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AC-19(1)",
        name: "КОНТРОЛЬ ДОСТУПУ ДЛЯ МОБІЛЬНИХ ПРИСТРОЇВ - ВИКОРИСТАННЯ ПИСЬМОВИХ ТА ПОРТАТИВНИЙ ПРИСТРОЇВ ДЛЯ ЗБЕРІГАННЯ ДАНИХ (AC-19(1))",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_19_1_01,
           "КОНТРОЛЬ ДОСТУПУ ДЛЯ МОБІЛЬНИХ ПРИСТРОЇВ - ВИКОРИСТАННЯ ПИСЬМОВИХ ТА ПОРТАТИВНИЙ ПРИСТРОЇВ ДЛЯ ЗБЕРІГАННЯ ДАНИХ [Вилучено: Включено в MP-07]",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AC-19(2)",
        name: "КОНТРОЛЬ ДОСТУПУ ДЛЯ МОБІЛЬНИХ ПРИСТРОЇВ - ВИКОРИСТАННЯ ПЕРСОНАЛЬНИХ ПОРТАТИВНИХ ПРИСТРОЇВ ЗБЕРІГАННЯ ДАНИХ (AC-19(2))",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_19_2_01,
           "КОНТРОЛЬ ДОСТУПУ ДЛЯ МОБІЛЬНИХ ПРИСТРОЇВ - ВИКОРИСТАННЯ ПЕРСОНАЛЬНИХ ПОРТАТИВНИХ ПРИСТРОЇВ ЗБЕРІГАННЯ ДАНИХ [Вилучено: Включено в MP-07]. AC-19(03) КОНТРОЛЬ ДОСТУПУ ДЛЯ МОБІЛЬНИХ ПРИСТРОЇВ - ВИКОРИСТАННЯ ПОРТАТИВНИХ ПРИСТРОЇВ ЗБЕРІГАННЯ ДАНИХ З НЕІДЕНТИФІКОВАНИМ ВЛАСНИКОМ [Вилучено: Включено в MP-07]",
           [type: :list, default: ["admin", "security_officer"]]}
        ]
      },
      %{
        id: "AC-19(4)",
        name: "КОНТРОЛЬ ДОСТУПУ ДЛЯ МОБІЛЬНИХ ПРИСТРОЇВ - ОБМЕЖЕННЯ ДЛЯ ЗАСЕКРЕЧЕНОЇ ІНФОРМАЦІЇ (AC-19(4))",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_19_4_a,
           "Використання незахищених мобільних пристроїв на об'єктах, що містять системи, які обробляють, зберігають або передають секретну інформацію, заборонено, за винятком випадків, коли на це є спеціальний дозвіл уповноваженої посадової особи; AC-19(04)(b)(01) заборона підключення незахищених мобільних пристроїв до систем з обмеженим доступом застосовується до осіб, яким уповноважена посадова особа дозволила використовувати незахищені мобільні пристрої на об'єктах, що містять системи, які обробляють, зберігають або передають інформацію з обмеженим доступом; AC-19(04)(b)(02) дозвіл уповноваженої посадової особи на підключення незахищених мобільних пристроїв до незахищених систем вимагається від осіб, яким дозволено використовувати незахищені мобільні пристрої на об'єктах, що містять системи, які обробляють, зберігають або передають інформацію з обмеженим доступом; AC-19(04)(b)(03) заборона використання внутрішніх або зовнішніх модемів чи бездротових інтерфейсів у складі незахищених мобільних пристроїв поширюється на осіб, яким уповноваженою посадовою особою дозволено використовувати незахищені мобільні пристрої під час виконання службових обов'язків, а також на осіб, які не мають права на використання таких пристроїв AC-19(04)(b)(04)[01] вибірковий огляд та перевірка незахищених мобільних пристроїв та інформації, що зберігається на них, посадовими особами є обов'язковими; AC-19(04)(b)(04)[02] дотримання політики обробки інцидентів застосовується у разі виявлення секретної інформації під час випадкового огляду та перевірки незахищених мобільних пристроїв",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ac_19_4_c,
           "Підключення захищенихмобільних пристроїв до засекречених систем обмежено відповідно до політики безпеки",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ac_19_4_odp_01,
           "Визначено посадових осіб із захисту інформації, відповідальних за огляд та перевірку захищених мобільних пристроїв та інформації, що зберігається на цих пристроях",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ac_19_4_odp_02,
           "Визначено політики безпеки, що обмежують підключення захищених мобільних пристроїв до засекречених систем",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]}
        ]
      },
      %{
        id: "AC-19(5)",
        name: "КОНТРОЛЬ ДОСТУПУ ДЛЯ МОБІЛЬНИХ ПРИСТРОЇВ - ПОВНЕ ШИФРУВАННЯ ПРИСТРОЇВ ТА СХОВИЩ ІНФОРМАЦІЇ (AC-19(5))",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: []
      },
      %{
        id: "AC-20",
        name: "ВИКОРИСТАННЯ ЗОВНІШНІХ СИСТЕМ (AC-20)",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_20_odp_01,
           "Вибрано одне або більше з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {встановити умови та положення; визначити заходи захисту}",
           [type: :list, default: []]},
          {:ac_20_odp_02,
           "Визначено умови та положення, що відповідають довірчим відносинам, встановленим з іншими організаціями, які володіють, експлуатують та/або обслуговують зовнішні системи (якщо вибрано)",
           [type: :list, default: []]},
          {:ac_20_odp_03,
           "Визначено заходи захисту, які мають бути застосовані до зовнішніх систем відповідно до довірчих відносин, встановлених з іншими організаціями, що володіють, експлуатують та/або обслуговують зовнішні системи (якщо обрано)",
           [type: :string, default: nil]},
          {:ac_20_odp_04,
           "Визначено типи зовнішніх систем, заборонених до використання",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AC-20(1)",
        name: "ВИКОРИСТАННЯ ЗОВНІШНІХ СИСТЕМ - ОБМЕЖЕННЯ НА АВТОРИЗОВАНЕ ВИКОРИСТАННЯ (AC-20(1))",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_20_1_a,
           "Авторизовані особи мають право використовувати зовнішню систему для доступу до системи або для обробки, зберігання чи передачі інформації, що контролюється організацією, лише після перевірки виконання заходів безпеки та конфіденційності, зазначених у політиці безпеки та конфіденційності організації, а також планах безпеки та конфіденційності (якщо такі застосовуються)",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ac_20_1_b,
           "Авторизовані особи мають право використовувати зовнішню систему для доступу до системи або для обробки, зберігання чи передачі інформації, що контролюється організацією, лише після збереження погоджених угод про підключення або обробку системи з структурою організації, на якій розміщена зовнішня система",
           [type: :list, default: ["admin", "security_officer"]]}
        ]
      },
      %{
        id: "AC-20(2)",
        name: "ВИКОРИСТАННЯ ЗОВНІШНІХ СИСТЕМ - ПЕРЕНОСНІ ПРИСТРОЇ ЗБЕРІГАННЯ ДАНИХ (AC-20(2))",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_20_2_01,
           "Використання портативних пристроїв носіїв інформації уповноваженими особами обмежено у зовнішніх системах за допомогою обмеження ",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ac_20_2_odp,
           "Визначено обмеження на використання авторизованими особами портативних носіїв інформації у зовнішніх системах",
           [type: :list, default: ["admin", "security_officer"]]}
        ]
      },
      %{
        id: "AC-22",
        name: "ПУБЛІЧНО ДОСТУПНИЙ КОНТЕНТ (AC-22)",
        text: "Політики управління доступом, привілеями та віддаленим доступом реалізуються централізовано через підсистеми IAM (Identity and Access Management) та ABAC (Attribute-Based Access Control) ЄСІКС з дотриманням принципу найменших привілеїв.",
        parameters: [
          {:ac_22_a,
           "Визначені особи уповноважені на розміщення інформації в загальнодоступній системі",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ac_22_b,
           "Уповноважені особи проходять навчання, щоб гарантувати, що загальнодоступна інформація не містить інформацію з обмеженим доступом",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ac_22_c,
           "Запропонований зміст інформації перевіряється до публікації в загальнодоступній системі, щоб гарантувати, що там не міститься інформація з обмеженим доступом",
           [type: :string, default: nil]},
          {:ac_22_d_01,
           "Зміст у загальнодоступній системі перевіряється на наявність інформації з обмеженим доступом з частотою",
           [type: :integer, default: 30]},
          {:ac_22_d_02,
           "Інформація з обмеженим доступом видаляється з загальнодоступної системи, якщо її виявлено",
           [type: :string, default: nil]},
          {:ac_22_odp,
           "Визначено частоту, з якою слід переглядати вміст загальнодоступної системи на предмет наявності там інформації з обмеженим доступом",
           [type: :integer, default: 30]}
        ]
      }
    ]
  },
  %{
    id: "AT",
    name: "ОБІЗНАНІСТЬ ТА НАВЧАННЯ (AT)",
    text: "Відповідальність за навчання та обізнаність з питань кібербезпеки несе організація-користувач відповідно до загальних політик ЄСІКС.",
    subcontrols: [
      %{
        id: "AT-1",
        name: "ПОЛІТИКА ТА ПРОЦЕДУРИ ПІДВИЩЕННЯ ОБІЗНАНОСТІ ТА НАВЧАННЯ (AT-1)",
        text: "Відповідальність за навчання та обізнаність з питань кібербезпеки несе організація-користувач відповідно до загальних політик ЄСІКС.",
        parameters: []
      },
      %{
        id: "AT-2",
        name: "НАВЧАННЯ З ПІДВИЩЕННЯ ОБІЗНАНОСТІ (AT-2)",
        text: "Програми навчання та інструктажі (див. розділ AT у digital-profile.pdf).",
        parameters: [
          %{
            default: "digital-profile.pdf",
            name: :security_awareness_training_ref,
            type: :string
          }
        ]
      },
      %{
        id: "AT-2(2)",
        name: "НАВЧАННЯ З ПІДВИЩЕННЯ ОБІЗНАНОСТІ | НАВЧАННЯ ЩОДО РОЗПІЗНАВАННЯ ВНУТРІШНЬОЇ ЗАГРОЗИ",
        text: "Відповідальність за навчання та обізнаність з питань кібербезпеки несе організація-користувач відповідно до загальних політик ЄСІКС.",
        parameters: [
          {:at_2_2_01,
           "Введено до програми навчання вправи з розпізнавання потенційних індикаторів внутрішніх загроз",
           [type: :string, default: nil]},
          {:at_2_2_02,
           "Введено до програми навчання вправи з виявлення потенційних індикаторів внутрішніх загроз",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AT-2(3)",
        name: "НАВЧАННЯ З ПІДВИЩЕННЯ ОБІЗНАНОСТІ | НАВЧАННЯ З ПИТАНЬ СОЦІАЛЬНОЇ ІНЖЕНЕРІЇ",
        text: "Відповідальність за навчання та обізнаність з питань кібербезпеки несе організація-користувач відповідно до загальних політик ЄСІКС.",
        parameters: [
          {:at_2_3_01,
           "До програми навчання введено вправи з розпізнавання потенційних та фактичних випадків соціального інжинірингу",
           [type: :string, default: nil]},
          {:at_2_3_02,
           "До програми навчання введено вправи з повідомлення про потенційні та фактичні випадки соціального інжинірингу",
           [type: :string, default: nil]},
          {:at_2_3_03,
           "До програми навчання введено вправи з розпізнавання потенційних та фактичних випадків інтелектуального аналізу соціальних даних",
           [type: :string, default: nil]},
          {:at_2_3_04,
           "До програми навчання введено вправи з повідомлення про потенційні та фактичні випадки інтелектуального аналізу соціальних даних",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AT-3",
        name: "РОЛЬОВЕ НАВЧАННЯ (AT-3)",
        text: "Спеціалізоване навчання для адміністраторів (див. розділ AT у digital-profile.pdf).",
        parameters: [
          %{
            default: "digital-profile.pdf",
            name: :role_based_training_ref,
            type: :string
          }
        ]
      }
    ]
  },
  %{
    id: "AU",
    name: "АУДИТ ТА ПІДЗВІТНІСТЬ (AU)",
    text: "Підсистема логування та аудиту автоматично фіксує всі події доступу (автентифікації/авторизації) та зміни даних. Журнали аудиту зберігаються в імутабельному сховищі не менше 3 місяців.",
    subcontrols: [
      %{
        id: "AU-1",
        name: "Політика та процедури аудиту та підзвітності (AU-1)",
        text: "Підсистема логування та аудиту автоматично фіксує всі події доступу (автентифікації/авторизації) та зміни даних. Журнали аудиту зберігаються в імутабельному сховищі не менше 3 місяців.",
        parameters: [
          {:au_1_a_01,
           "Розроблено та задокументовано політику аудиту та підзвітності",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:au_1_a_02,
           "Політика аудиту та підзвітності доведена до персонал або ролі",
           [type: :list, default: ["admin", "security_officer"]]},
          {:au_1_a_03,
           "Розроблені та задокументовані процедури аудиту та підзвітності, що сприяють впровадженню політики аудиту та підзвітності, а також відповідні заходи контролю аудиту та підзвітності",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:au_1_b,
           "Посадова особа призначається для управління політикою та процедурами аудиту та підзвітності AU-01(c)[01][01] переглядається та оновлюється поточна політика аудиту та підзвітності з частота; AU-01(c)[01][02] переглядається та оновлюється поточна політика аудиту та підзвітності після подій; AU-01(c)[02][01] переглядається та оновлюється поточні процедури аудиту та підзвітності з частота; AU-01(c)[02][02] переглядається та оновлюється поточні процедури аудиту та підзвітності після подій",
           [type: :list, default: ["admin", "security_officer"]]},
          {:au_1_odp_01,
           "Визначено персонал або ролі, до яких має бути доведена політика аудиту та підзвітності",
           [type: :list, default: ["admin", "security_officer"]]},
          {:au_1_odp_02,
           "Визначено персонал або ролі, на які поширюються процедури аудиту та підзвітності",
           [type: :list, default: ["admin", "security_officer"]]},
          {:au_1_odp_03,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {рівень організації; рівень місії/бізнес-процесу; рівень системи}",
           [type: :string, default: nil]},
          {:au_1_odp_04,
           "Визначено посадову особу, яка управлятиме політикою та процедурами аудиту та підзвітності",
           [type: :list, default: ["admin", "security_officer"]]},
          {:au_1_odp_05,
           "Визначено частоту, з якою переглядається та оновлюється поточна політика аудиту та підзвітності",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:au_1_odp_06,
           "Визначено події, які потребують перегляду та оновлення поточної політики аудиту та підзвітності",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:au_1_odp_07,
           "Визначено частоту, з якою переглядаються та оновлюються поточні процедури аудиту та підзвітності",
           [type: :integer, default: 30]},
          {:au_1_odp_08,
           "Визначено події, які потребують перегляду та оновлення поточної процедури аудиту та підзвітності",
           [type: :list, default: ["login", "logout", "failed_attempt"]]}
        ]
      },
      %{
        id: "AU-2",
        name: "ПОДІЇ АУДИТУ (AU-2)",
        text: "Підсистема логування та аудиту автоматично фіксує всі події доступу (автентифікації/авторизації) та зміни даних. Журнали аудиту зберігаються в імутабельному сховищі не менше 3 місяців.",
        parameters: [
          {:au_2_a,
           "Типи подій, які система здатна реєструвати, визначено для підтримки функції аудиту",
           [type: :string, default: nil]},
          {:au_2_b,
           "Функція аудиту безпеки координується з іншими підрозділами організації, які вимагають інформації, пов'язаної з аудитом, длдля посилення взаємної підтримки та допомоги у виборі типів подій, що перевіряються",
           [type: :string, default: nil]},
          {:au_2_c_01,
           "Типи подій (підмножина 02_ODP[01]) визначаються для реєстрації у системі; AU-",
           [type: :string, default: nil]},
          {:au_2_c_02,
           "Зазначені типи подій реєструються 02_ODP[03] частота або ситуація>; <AU-",
           [type: :string, default: "щорічно"]},
          {:au_2_d,
           "Надається обґрунтування, чому типи подій, що перевіряються, вважаються достатніми для підтримки розслідувань інцидентів (постфактум), пов’язаних з безпекою та конфіденційністю",
           [type: :string, default: nil]},
          {:au_2_e,
           "Переглядаються та оновлюються типи подій, вибрані для реєстрації, частота. у системі",
           [type: :string, default: "щорічно"]},
          {:au_2_odp_01,
           "Визначено типи подій, які система може реєструвати для підтримки функції аудиту",
           [type: :string, default: nil]},
          {:au_2_odp_02,
           "Визначено типи подій (підмножина AU-02_ODP[01]) що підлягають аудиту у системі",
           [type: :string, default: nil]},
          {:au_2_odp_03,
           "Визначено частоту або ситуацію, що вимагає проведення аудиту для кожної ідентифікованої події",
           [type: :list, default: ["login", "logout", "failed_attempt"]]},
          {:au_2_odp_04,
           "Частота перегляду та оновлення типів подій, обраних для журналювання",
           [type: :string, default: "щорічно"]}
        ]
      },
      %{
        id: "AU-3",
        name: "ЗМІСТ ЗАПИСІВ АУДИТУ (AU-3)",
        text: "Інформація в логах BPMN (особливо при збереженні об'єктів BPE/ABAC) містить вичерпні метадані: тип події, суб'єкт, цільовий об'єкт, результат операції (Permit/Deny) та позначку часу, що повністю закриває вимоги AU-3.",
        parameters: [
          %{default: true, name: :audit_content_metadata, type: :boolean}
        ]
      },
      %{
        id: "AU-3(1)",
        name: "ЗМІСТ ЗАПИСІВ АУДИТУ - ДОДАТКОВА ІНФОРМАЦІЯ ПРО АУДИТ (AU-3(1))",
        text: "Підсистема логування та аудиту автоматично фіксує всі події доступу (автентифікації/авторизації) та зміни даних. Журнали аудиту зберігаються в імутабельному сховищі не менше 3 місяців.",
        parameters: [
          {:au_3_1_01,
           "ЗМІСТ ЗАПИСІВ АУДИТУ - ДОДАТКОВА ІНФОРМАЦІЯ ПРО АУДИТ МЕТА ОЦІНКИ: Визначити, чи:",
           [type: :string, default: nil]},
          {:au_3_1_odp,
           "Визначено додаткову інформацію, яка має бути включена до записів аудиту",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AU-5",
        name: "РЕАГУВАННЯ НА ВІДМОВИ ОБРОБКИ ДАНИХ АУДИТУ (AU-5)",
        text: "Підсистема логування та аудиту автоматично фіксує всі події доступу (автентифікації/авторизації) та зміни даних. Журнали аудиту зберігаються в імутабельному сховищі не менше 3 місяців.",
        parameters: [
          {:au_5_a,
           "Персонал або ролі отримують сповіщення у разі збою процесу обробки даних аудиту періоду часу",
           [type: :list, default: ["admin", "security_officer"]]},
          {:au_5_b,
           "Додаткові дії виконуються у разі збою процесу обробки даних аудиту",
           [type: :list, default: ["login", "logout", "failed_attempt"]]},
          {:au_5_odp_01,
           "Визначено персонал або ролі, які отримують сповіщення про збої в процесі обробки даних аудиту ",
           [type: :list, default: ["admin", "security_officer"]]},
          {:au_5_odp_02,
           "Визначено період часу, протягом якого персонал або ролі отримують сповіщення про збої в процесі обробки даних аудиту",
           [type: :list, default: ["admin", "security_officer"]]},
          {:au_5_odp_03,
           "Визначено додаткові дії, яких слід вжити у випадку збою в процесі обробки даних аудиту ",
           [type: :list, default: ["login", "logout", "failed_attempt"]]}
        ]
      },
      %{
        id: "AU-6",
        name: "ОГЛЯД, АНАЛІЗ І ЗВІТНІСТЬ АУДИТУ (AU-6)",
        text: "Аналіз аудиту відбувається за допомогою консольних інструментів платформи (наприклад, `kvs:hist/1` або інтерфейсів Erlang Shell). Також доступний експорт журналів для SIEM.",
        parameters: [
          %{default: true, name: :audit_analysis_tools, type: :boolean}
        ]
      },
      %{
        id: "AU-6(3)",
        name: "ОГЛЯД, АНАЛІЗ І ЗВІТНІСТЬ АУДИТУ - ЗІСТАВЛЯННЯ СХОВИЩ АУДИТУ (AU-6(3))",
        text: "Підсистема логування та аудиту автоматично фіксує всі події доступу (автентифікації/авторизації) та зміни даних. Журнали аудиту зберігаються в імутабельному сховищі не менше 3 місяців.",
        parameters: [
          {:au_6_3_01,
           "Аналізуєються та зіставляються записи аудиту в різних сховищах, задля забезпечення ситуативної обізнаності в масштабах організації",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AU-7",
        name: "СКОРОЧЕННЯ ЗАПИСІВ АУДИТУ ТА ФОРМУВАННЯ ЗВІТУ (AU-7)",
        text: "Забезпечити та реалізувати можливості скорочення записів перевірок аудитом і звітів, до рівня, який:\na. підтримує перевірку, аналіз і звітність аудиту на вимогу та розслідування (постфактум) інцидентів безпеки;\nb. не змінює оригінальний вміст або час упорядкування записів аудиту.",
        parameters: [
          {:au_7_a_02,
           "Реалізовано можливість скорочення записів перевірок аудитом та звітів, до рінвня що підтримує перевірку, аналіз і звітність аудиту на вимогу та розслідування (постфактум) інцидентів безпеки",
           [type: :string, default: nil]},
          {:au_7_b_01,
           "Забезпечено можливість скорочення записів перевірок аудитом та звітів, які не змінюють оригінальний зміст або час упорядкування записів аудиту",
           [type: :integer, default: 30]},
          {:au_7_b_02,
           "Реалізовано можливість скорочення записів перевірок аудитом та звітів, які не змінюють оригінальний зміст або час упорядкування записів аудиту",
           [type: :integer, default: 30]}
        ]
      },
      %{
        id: "AU-8",
        name: "ПОЗНАЧКА ЧАСУ (AU-8)",
        text: "Підсистема логування та аудиту автоматично фіксує всі події доступу (автентифікації/авторизації) та зміни даних. Журнали аудиту зберігаються в імутабельному сховищі не менше 3 місяців.",
        parameters: [
          {:au_8_a,
           "Внутрішній системний годинник використовується для створення позначок часу для записів аудиту",
           [type: :integer, default: 30]},
          {:au_8_b,
           "Позначки часу застосовуються для записів аудиту, які відповідають деталізація вимірювання часу і які використовують всесвітній координований час, мають фіксоване місцеве зміщення місцевого часу від всесвітнього координованого часу або включають зміщення місцевого часу як частину позначки часу",
           [type: :integer, default: 30]},
          {:au_8_odp,
           "Визначено деталізацію вимірювання часу для часових позначок записів аудиту",
           [type: :integer, default: 30]}
        ]
      },
      %{
        id: "AU-9",
        name: "ЗАХИСТ ІНФОРМАЦІЇ АУДИТУ (AU-9)",
        text: "Підсистема логування та аудиту автоматично фіксує всі події доступу (автентифікації/авторизації) та зміни даних. Журнали аудиту зберігаються в імутабельному сховищі не менше 3 місяців.",
        parameters: [
          {:au_9_01,
           "ЗАХИСТ ІНФОРМАЦІЇ АУДИТУ МЕТА ОЦІНКИ: Визначити, чи:",
           [type: :string, default: nil]},
          {:au_9_a,
           "Інформація про аудит та інструменти журналювання аудиту захищені від несанкціонованого доступу, зміни та видалення",
           [type: :string, default: nil]},
          {:au_9_b,
           "Персонал або ролі отримують сповіщення при виявленні несанкціонованого доступу, зміни або видалення інформації аудиту",
           [type: :list, default: ["admin", "security_officer"]]},
          {:au_9_odp,
           "Визначено персонал або ролі, які мають бути сповіщені при виявленні несанкціонованого доступу, зміни або видалення інформації аудиту",
           [type: :list, default: ["admin", "security_officer"]]}
        ]
      },
      %{
        id: "AU-9(4)",
        name: "ЗАХИСТ ІНФОРМАЦІЇ АУДИТУ - ДОСТУП, ЯКИЙ НАДАЄТЬСЯ ЧЕРЕЗ ЧЛЕНСТВО В ПІДМНОЖИНИ ПРИВІЛЕЙОВАНИХ КОРИСТУВАЧІВ (AU-9(4))",
        text: "Підсистема логування та аудиту автоматично фіксує всі події доступу (автентифікації/авторизації) та зміни даних. Журнали аудиту зберігаються в імутабельному сховищі не менше 3 місяців.",
        parameters: [
          {:au_9_4_01,
           "Авторизувати доступ до управління функціональністю аудиту тільки для підмножини привілейованих користувачів",
           [type: :string, default: nil]},
          {:au_9_4_odp,
           "Визначено підмножину привілейованих користувачів",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AU-10",
        name: "НЕСПРОСТОВНІСТЬ (AU-10)",
        text: "Підсистема логування та аудиту автоматично фіксує всі події доступу (автентифікації/авторизації) та зміни даних. Журнали аудиту зберігаються в імутабельному сховищі не менше 3 місяців.",
        parameters: [
          {:au_10_01,
           "Надаються неспростовні докази того, що особа (або процес, що діє від імені особи) виконала дії",
           [type: :list, default: ["admin", "security_officer"]]},
          {:au_10_odp,
           "Визначено дії, на які поширюється принцип неспростовності",
           [type: :list, default: ["login", "logout", "failed_attempt"]]}
        ]
      },
      %{
        id: "AU-10(5)",
        name: "НЕСПРОСТОВНІСТЬ - ЦИФРОВІ ПІДПИСИ (AU-10(5))",
        text: "Підсистема логування та аудиту автоматично фіксує всі події доступу (автентифікації/авторизації) та зміни даних. Журнали аудиту зберігаються в імутабельному сховищі не менше 3 місяців.",
        parameters: [
          {:au_10_5_01,
           "НЕСПРОСТОВНІСТЬ - ЦИФРОВІ ПІДПИСИ [Вилучено: Включено до SI-07]",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "AU-11",
        name: "ЗБЕРЕЖЕННЯ ЗАПИСІВ АУДИТУ (AU-11)",
        text: "Підсистема логування та аудиту автоматично фіксує всі події доступу (автентифікації/авторизації) та зміни даних. Журнали аудиту зберігаються в імутабельному сховищі не менше 3 місяців.",
        parameters: [
          {:au_11_01,
           "Записи аудиту зберігаються впродовж період часу, щоб забезпечити підтримку розслідування (постфактум) інцидентів безпеки та конфіденційності, а також відповідати нормативним та вимогам організації щодо збереження даних аудиту",
           [type: :integer, default: 30]},
          {:au_11_odp,
           "Визначено період часу для зберігання записів аудиту, який узгоджується з політикою зберігання записів",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]}
        ]
      },
      %{
        id: "AU-12",
        name: "ГЕНЕРАЦІЯ ДАНИХ АУДИТУ (AU-12)",
        text: "KVS забезпечує генерацію записів аудиту для всіх операцій створення, оновлення (через створення нової ревізії) та видалення, гарантуючи фіксацію критичних подій безпеки.",
        parameters: [%{default: true, name: :audit_generation, type: :boolean}]
      }
    ]
  },
  %{
    id: "CA",
    name: "ОЦІНЮВАННЯ, АВТОРИЗАЦІЯ ТА МОНІТОРИНГ (CA)",
    text: "Моніторинг та авторизація компонентів ЄСІКС здійснюється на рівні інфраструктури безпеки, з регулярною перевіркою відповідності стандартам (OWASP Top 10, ДСТУ).",
    subcontrols: [
      %{
        id: "CA-1",
        name: "ПОЛІТИКА І ПРОЦЕДУРИ ОЦІНЮВАННЯ, АКРЕДИТАЦІЯ ТА МОНІТОРИНГ БЕЗПЕКИ (CA-1)",
        text: "Моніторинг та авторизація компонентів ЄСІКС здійснюється на рівні інфраструктури безпеки, з регулярною перевіркою відповідності стандартам (OWASP Top 10, ДСТУ).",
        parameters: [
          {:ca_1_a_01,
           "Розроблено та задокументовано політику оцінювання, авторизації та моніторингу",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ca_1_a_02,
           "Політика оцінювання, авторизації та моніторингу поширюється серед персоналу або ролей",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ca_1_a_03,
           "Розроблені та задокументовані процедури оцінювання, авторизації та моніторингу, що сприяють впровадженню політики оцінювання, авторизації та моніторингу, а також пов'язані з ними засоби контролю оцінювання, авторизації та моніторингу",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ca_1_b,
           "Посадова особа призначається для управління розробкою, документуванням та розповсюдженням політики та процедур оцінювання, авторизації та моніторингу; CA-01(c)[01][01] переглядається та оновлюється поточна політика оцінки, авторизації та моніторингу з частотою; CA-01(c)[01][02] переглядається та оновлюється поточна політика оцінки, авторизації та моніторингу після подій; CA-01(c)[02][01] переглядаються та оновлюються поточні процедури оцінки, авторизації та моніторингу з частотою; CA-01(c)[02][02] переглядаються та оновлюються поточні процедури оцінки, авторизації та моніторингу після подій; ПОТЕНЦІЙНІ МЕТОДИ ТА ОБ’ЄКТИ ОЦІНКИ:",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ca_1_odp_01,
           "Визначено персонал або ролі, серед яких має бути поширена політика оцінювання, авторизації та моніторингу",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ca_1_odp_02,
           "Визначено персонал або ролі, серед яких мають бути поширені процедури оцінювання, авторизації та моніторингу",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ca_1_odp_03,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {рівень організації; рівень місії/бізнес-процесу; рівень системи}",
           [type: :string, default: nil]},
          {:ca_1_odp_04,
           "Визначено посадову особу, яка управлятиме розробкою, документуванням і розповсюдженням політики та процедур оцінювання, авторизації та моніторингу",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ca_1_odp_05,
           "Визначено частоту, з якою переглядається та оновлюється поточна політика оцінювання, авторизації та моніторингу",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ca_1_odp_06,
           "Визначено події, які потребують перегляду та оновлення поточної політики оцінки, авторизації та моніторингу",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ca_1_odp_07,
           "Визначено частоту, з якою переглядається та оновлюється поточні процедури оцінювання, авторизації та моніторингу",
           [type: :integer, default: 30]},
          {:ca_1_odp_08,
           "Визначено події, які потребують перегляду та оновлення поточні процедури оцінки, авторизації та моніторингу",
           [type: :list, default: ["login", "logout", "failed_attempt"]]}
        ]
      },
      %{
        id: "CA-2",
        name: "ОЦІНЮВАННЯ (CA-2)",
        text: "Моніторинг та авторизація компонентів ЄСІКС здійснюється на рівні інфраструктури безпеки, з регулярною перевіркою відповідності стандартам (OWASP Top 10, ДСТУ).",
        parameters: [
          {:ca_2_a,
           "Обрано відповідного оцінювача або команду оцінювачів для проведення оцінювання",
           [type: :string, default: nil]},
          {:ca_2_b_01,
           "Розроблено план контрольної оцінки, який описує обсяг оцінки, включаючи заходи захисту та посилені заходи, що підлягають оцінюванню. CA-02(b)[02] розроблено план контрольної оцінки, який описує обсяг оцінки, включаючи процедури оцінювання, які використовуватимуться для визначення ефективності заходів. CA-02(b)[03][01] розроблено план контрольної оцінки, який описує обсяг оцінки, включаючи середовище оцінювання. CA-02(b)[03][02] розроблено план контрольної оцінки, який описує обсяг оцінки, включаючи групу оцінювання. CA-02(b)[03][03] розроблено план контрольної оцінки, який описує обсяг оцінки, включаючи ролі й обов’язки з оцінювання",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ca_2_b_02,
           "Розроблено план контрольної оцінки, який описує обсяг оцінки, включаючи процедури оцінювання, які використовуватимуться для визначення ефективності заходів. CA-02(b)[03][01] розроблено план контрольної оцінки, який описує обсяг оцінки, включаючи середовище оцінювання. CA-02(b)[03][02] розроблено план контрольної оцінки, який описує обсяг оцінки, включаючи групу оцінювання. CA-02(b)[03][03] розроблено план контрольної оцінки, який описує обсяг оцінки, включаючи ролі й обов’язки з оцінювання",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ca_2_c,
           "План оцінки заходів захисту розглядається та затверджується уповноваженою посадовою особою або призначеним представником перед проведенням оцінки",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ca_2_d_01,
           "Заходи захисту оцінюються в системі та середовищі її функціонування частота оцінки, щоб визначити, наскільки коректно реалізовані заходи захисту, чи працюють вони за призначенням і чи дають бажаний результат щодо дотримання встановлених вимог до безпеки",
           [type: :string, default: "щорічно"]},
          {:ca_2_d_02,
           "Заходи захисту оцінюються в системі та середовищі її функціонування частота оцінки, щоб визначити, наскільки коректно реалізовані заходи захисту, чи працюють вони за призначенням і чи дають бажаний результат щодо дотримання встановлених вимог до конфіденційності; CA-02(e) готується звіт оцінювання",
           [type: :string, default: "щорічно"]},
          {:ca_2_f,
           "Результати оцінювання з безпеки надаються особам або ролям. оцінювання , який документує результати",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ca_2_odp_01,
           "Визначено частоту, з якою слід оцінювати засоби контролю в системі та середовищі її функціонування",
           [type: :integer, default: 30]},
          {:ca_2_odp_02,
           "Визначені особи або ролі, яким мають бути надані результати оцінювання з безпеки",
           [type: :list, default: ["admin", "security_officer"]]}
        ]
      },
      %{
        id: "CA-3",
        name: "ВЗАЄМОДІЯ СИСТЕМ (CA-3)",
        text: "Моніторинг та авторизація компонентів ЄСІКС здійснюється на рівні інфраструктури безпеки, з регулярною перевіркою відповідності стандартам (OWASP Top 10, ДСТУ).",
        parameters: [
          {:ca_3_b_01,
           "Характеристики інтерфейсу задокументовані як частина кожної угоди про обмін",
           [type: :integer, default: 30]},
          {:ca_3_b_02,
           "Вимоги до безпеки задокументовані як частина кожної угоди про обмін",
           [type: :integer, default: 30]},
          {:ca_3_b_03,
           "Вимоги щодо конфіденційності задокументовані як частина кожної угоди про обмін",
           [type: :integer, default: 30]},
          {:ca_3_b_04,
           "Заходи захисту задокументовані як частина кожної угоди про обмін",
           [type: :integer, default: 30]},
          {:ca_3_b_05,
           "Відповідальність за кожну систему задокументована як частина кожної угоди про обмін",
           [type: :integer, default: 30]},
          {:ca_3_b_06,
           "Характер переданої інформації документується як частина кожної угоди про обмін",
           [type: :integer, default: 30]},
          {:ca_3_c,
           "Угоди переглядаються та оновлюються частота",
           [type: :string, default: "щорічно"]},
          {:ca_3_odp_01,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {): угоди безпеки взаємозв’язку; договори безпеки обміну інформацією; меморандуми про взаєморозуміння; угоди про рівень обслуговування; угоди користувача; угоди про нерозголошення; тип угоди}",
           [type: :string, default: nil]},
          {:ca_3_odp_02,
           "Визначено тип угоди, який використовується для схвалення та керування обміном інформацією (якщо вибрано)",
           [type: :string, default: nil]},
          {:ca_3_odp_03,
           "Визначено частоту, з якою необхідно переглядати та оновлювати угоди",
           [type: :integer, default: 30]}
        ]
      },
      %{
        id: "CA-5",
        name: "ПЛАН УСУНЕННЯ НЕДОЛІКІВ ТА КОНТРОЛЬНІ ПОКАЗНИКИ (CA-5)",
        text: "Моніторинг та авторизація компонентів ЄСІКС здійснюється на рівні інфраструктури безпеки, з регулярною перевіркою відповідності стандартам (OWASP Top 10, ДСТУ).",
        parameters: [
          {:ca_5_a,
           "Розроблено план усунення недоліків та контрольні показники для системи, та задокументувано заплановані дії організації з коригування, спрямовані на усунення недоліків та зауважень, виявлених під час оцінки заходів захисту, а також на зменшення або усунення відомих вразливостей в системі",
           [type: :list, default: ["login", "logout", "failed_attempt"]]},
          {:ca_5_b,
           "Існуючий план оновлюються частота на основі результатів оцінювання заходів, незалежних аудитів та постійного моніторингу",
           [type: :string, default: "щорічно"]},
          {:ca_5_odp,
           "Визначено частоту оновлення чинного плану усунення недоліків та контрольних показників на основі результатів оцінювання заходів захисту, незалежних аудитів та постійного моніторингу",
           [type: :integer, default: 30]}
        ]
      },
      %{
        id: "CA-7",
        name: "БЕЗПЕРЕРВНИЙ МОНІТОРИНГ (CA-7)",
        text: "Моніторинг та авторизація компонентів ЄСІКС здійснюється на рівні інфраструктури безпеки, з регулярною перевіркою відповідності стандартам (OWASP Top 10, ДСТУ).",
        parameters: [
          {:ca_7_01,
           "Розроблено стратегію безперервного моніторингу на системному рівні; CA-07[02] безперервний моніторинг на рівні системи здійснюється відповідно до стратегії безперервного моніторингу на рівні організації",
           [type: :string, default: nil]},
          {:ca_7_a,
           "Безперервний моніторинг на рівні системи включає встановлення наступних метрик на рівні системи, які підлягають моніторингу: метрики системного рівня",
           [type: :string, default: nil]},
          {:ca_7_b_01,
           "Безперервний моніторинг на рівні системи включає встановлені частоти для моніторингу ефективності заходів захисту",
           [type: :integer, default: 30]},
          {:ca_7_b_02,
           "Безперервний моніторинг на рівні системи включає встановлені частоти для оцінки ефективності заходів захисту",
           [type: :integer, default: 30]},
          {:ca_7_c,
           "Безперервний моніторинг на рівні системи включає поточні контрольні оцінки відповідно до стратегії безперервного моніторингу",
           [type: :string, default: nil]},
          {:ca_7_d,
           "Безперервний моніторинг на рівні системи включає постійний моніторинг визначених системою та організацією показників відповідно до стратегії безперервного моніторингу",
           [type: :string, default: nil]},
          {:ca_7_e,
           "Безперервний моніторинг на рівні системи включає зіставлення та аналіз інформації, отриманої в результаті оцінювання та моніторингу",
           [type: :string, default: nil]},
          {:ca_7_f,
           "Безперервний моніторинг на рівні системи включає в себе дії з реагування на результати аналізу інформації, пов’язаної з безпекою та приватністю",
           [type: :list, default: ["login", "logout", "failed_attempt"]]},
          {:ca_7_g_01,
           "Безперервний моніторинг на рівні системи включає повідомлення про статус безпеки системи для персоналу або ролей частота",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ca_7_g_02,
           "Безперервний моніторинг на рівні системи включає повідомлення про стан конфіденційності системи персоналу або ролям частота",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ca_7_odp_01,
           "Визначено метрики системного рівня, які підлягають моніторингу",
           [type: :string, default: nil]},
          {:ca_7_odp_02,
           "Визначено частоту, з якою слід моніторити ефективність заходів захисту",
           [type: :integer, default: 30]},
          {:ca_7_odp_03,
           "Визначено частоту, з якою слід оцінювати ефективність заходів захисту",
           [type: :integer, default: 30]},
          {:ca_7_odp_04,
           "Визначено персонал або ролі, яким повідомляється про стан безпеки системи",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ca_7_odp_05,
           "Визначено частоту, з якою повідомляється про стан безпеки системи",
           [type: :integer, default: 30]},
          {:ca_7_odp_06,
           "Визначено персонал або ролі, яким повідомляється про стан конфіденційності системи",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ca_7_odp_07,
           "Визначено частоту, з якою повідомляється про стан конфіденційності системи",
           [type: :integer, default: 30]}
        ]
      }
    ]
  },
  %{
    id: "CM",
    name: "УПРАВЛІННЯ КОНФІГУРАЦІЄЮ (CM)",
    text: "Управління конфігураціями та оновленнями (CM) здійснюється згідно з політиками ІСС. Вразливі компоненти оновлюються протягом 5 днів після виявлення в exploit-db. Конфігураційні файли зберігаються в зашифрованому вигляді.",
    subcontrols: [
      %{
        id: "CM-1",
        name: "Політика та процедури управління конфігурацією (CM-1)",
        text: "Управління конфігураціями та оновленнями (CM) здійснюється згідно з політиками ІСС. Вразливі компоненти оновлюються протягом 5 днів після виявлення в exploit-db. Конфігураційні файли зберігаються в зашифрованому вигляді.",
        parameters: [
          {:cm_1_a_01,
           "Розроблено та задокументовано політику управління конфігурацією",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:cm_1_a_02,
           "Політика управління конфігурацією поширюється на персонал або ролі",
           [type: :list, default: ["admin", "security_officer"]]},
          {:cm_1_a_03,
           "Розроблені та задокументовані процедури управління , що сприяють реалізації політики управління конфігурацією та пов’язаних з нею заходів управління конфігурацією",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:cm_1_b,
           "Посадова особа призначається для управління розробкою, документуванням і розповсюдженням політики та процедур керування конфігурацією; CM-01(c)[01][01] переглядається та оновлюється поточна політика управління конфігурацією частота; CM-01(c)[01][02] переглядається та оновлюється поточна політика управління конфігурацією після події; CM-01(c)[02][01] переглядаються та оновлюються поточні процедури управління конфігурацією частота; CM-01(c)[02][02] переглядаються та оновлюються поточні процедури управління конфігурацією після події; ЗНАЧЕННЯ конфігурацією",
           [type: :list, default: ["admin", "security_officer"]]},
          {:cm_1_odp_01,
           "Визначено персонал або ролі, на яких поширюється політика управління конфігурацією",
           [type: :list, default: ["admin", "security_officer"]]},
          {:cm_1_odp_02,
           "Визначено персонал або ролі, на яких поширюється процедури управління конфігурацією",
           [type: :list, default: ["admin", "security_officer"]]},
          {:cm_1_odp_03,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {рівень організації; рівень місії/бізнес-процесу; рівень системи}",
           [type: :string, default: nil]},
          {:cm_1_odp_04,
           "Визначено посадову особу, яка управляє розробкою, документуванням і розповсюдженням політики та процедур керування конфігурацією",
           [type: :list, default: ["admin", "security_officer"]]},
          {:cm_1_odp_05,
           "Визначено частоту, з якою переглядається та оновлюється поточна політика управління конфігурацією",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:cm_1_odp_06,
           "Визначено події, після яких переглядається та оновлюється поточна політика управління конфігурацією",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:cm_1_odp_07,
           "Визначено частоту, з якою переглядаються та оновлюються поточні процедури управління конфігурацією",
           [type: :integer, default: 30]},
          {:cm_1_odp_08,
           "Визначено події, після яких переглядаються та оновлюються поточні процедури управління конфігурацією",
           [type: :list, default: ["login", "logout", "failed_attempt"]]}
        ]
      },
      %{
        id: "CM-2",
        name: "БАЗОВА КОНФІГУРАЦІЯ (CM-2)",
        text: "Файл `erpuno.ex` фіксує єдину базову конфігурацію (Baseline) безпеки для всієї системи. Зміни в конфігурації застосовуються виключно через оновлення коду, що забезпечує строгий контроль та аудит змін.",
        parameters: [
          %{default: true, name: :baseline_configuration_code, type: :boolean}
        ]
      },
      %{
        id: "CM-2(7)",
        name: "БАЗОВА КОНФІГУРАЦІЯ - КОНФІГУРАЦІЯ СИСТЕМ ТА КОМПОНЕНТІВ ДЛЯ СФЕР З ВИСОКИМ РИЗИКОМ (CM-2(7))",
        text: "Управління конфігураціями та оновленнями (CM) здійснюється згідно з політиками ІСС. Вразливі компоненти оновлюються протягом 5 днів після виявлення в exploit-db. Конфігураційні файли зберігаються в зашифрованому вигляді.",
        parameters: [
          {:cm_2_7_a,
           "Системи або компоненти системи з конфігураціями видаються особам, що перебувають у місцях, які організація вважає, становлять значний ризик",
           [type: :list, default: ["admin", "security_officer"]]},
          {:cm_2_7_b,
           "Заходи безпеки застосовуються до систем або компонентів системи, коли особи повертаються з поїздки",
           [type: :list, default: ["admin", "security_officer"]]},
          {:cm_2_7_odp_01,
           "Визначено системи або компоненти систем, які мають видаватися особам, що перебувають у місцях зі значним ризиком",
           [type: :list, default: ["admin", "security_officer"]]}
        ]
      },
      %{
        id: "CM-3",
        name: "УПРАВЛІННЯ ЗМІНАМИ КОНФІГУРАЦІЇ (CM-3)",
        text: "Оскільки CMDB є частиною вихідного коду (Elixir модуль), всі зміни проходять через стандартний процес розробки (Code Review, CI/CD, контроль версій Git), унеможливлюючи несанкціоноване втручання в налаштування на \"живій\" системі.",
        parameters: [
          %{default: true, name: :configuration_change_control, type: :boolean}
        ]
      },
      %{
        id: "CM-4",
        name: "АНАЛІЗ ВПЛИВУ НА БЕЗПЕКУ ТА ПРИВАТНІСТЬ (CM-4)",
        text: "Управління конфігураціями та оновленнями (CM) здійснюється згідно з політиками ІСС. Вразливі компоненти оновлюються протягом 5 днів після виявлення в exploit-db. Конфігураційні файли зберігаються в зашифрованому вигляді.",
        parameters: [
          {:cm_4_01,
           "Аналізуються зміни в системі, щоб визначити потенційну загрозу безпеці перед реалізацією змін",
           [type: :string, default: nil]},
          {:cm_4_02,
           "Аналізуються зміни в системі, щоб визначити потенційну загрозу конфіденційності перед реалізацією змін",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "CM-4(2)",
        name: "АНАЛІЗ ВПЛИВУ НА БЕЗПЕКУ ТА ПРИВАТНІСТЬ - ВЕРИФІКАЦІЯ ФУНКЦІЙ БЕЗПЕКИ ТА ПРИВАТНОСТІ (CM-4(2))",
        text: "Управління конфігураціями та оновленнями (CM) здійснюється згідно з політиками ІСС. Вразливі компоненти оновлюються протягом 5 днів після виявлення в exploit-db. Конфігураційні файли зберігаються в зашифрованому вигляді.",
        parameters: [
          {:cm_4_2_01,
           "Заходи захисту, на які було здійснено вплив, реалізовані правильно з точки зору відповідності вимогам безпеки системи після внесення змін до системи",
           [type: :string, default: nil]},
          {:cm_4_2_02,
           "Заходи захисту, на які було здійснено вплив, реалізовані правильно з точки зору відповідності вимогам конфіденційності системи після внесення змін до системи",
           [type: :string, default: nil]},
          {:cm_4_2_03,
           "Заходи захисту, на які було здійснено вплив, функціонують належним чином з точки зору відповідності вимогам безпеки системи після внесення змін до системи",
           [type: :string, default: nil]},
          {:cm_4_2_04,
           "Заходи захисту, на які було здійснено вплив, функціонують належним чином з точки зору відповідності вимогам конфіденційності системи після внесення змін до системи",
           [type: :string, default: nil]},
          {:cm_4_2_05,
           "Заходи захисту, на які було здійснено вплив, дають бажаний результат з точки зору відповідності вимогам безпеки системи після внесення змін до системи",
           [type: :string, default: nil]},
          {:cm_4_2_06,
           "Заходи захисту, на які було здійснено вплив, дають бажаний результат з точки зору відповідності вимогам конфіденційності системи після внесення змін до системи; ПОТЕНЦІЙНІ МЕТОДИ ТА ОБ’ЄКТИ ОЦІНКИ:",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "CM-5",
        name: "ОБМЕЖЕННЯ ДОСТУПУ ДО ЗМІНИ (CM-5)",
        text: "Управління конфігураціями та оновленнями (CM) здійснюється згідно з політиками ІСС. Вразливі компоненти оновлюються протягом 5 днів після виявлення в exploit-db. Конфігураційні файли зберігаються в зашифрованому вигляді.",
        parameters: [
          {:cm_5_01,
           "Визначені та задокументовані фізичні обмеження доступу, пов'язані зі змінами в системі",
           [type: :string, default: nil]},
          {:cm_5_02,
           "Затверджені фізичні обмеження доступу, пов'язані зі змінами в системі",
           [type: :string, default: nil]},
          {:cm_5_03,
           "Застосовуються фізичні обмеження доступу, пов'язані зі змінами в системі",
           [type: :string, default: nil]},
          {:cm_5_04,
           "Визначені та задокументовані логічні обмеження доступу, пов'язані зі змінами в системі",
           [type: :string, default: nil]},
          {:cm_5_05,
           "Затверджені логічні обмеження доступу, пов'язані зі змінами в системі",
           [type: :string, default: nil]},
          {:cm_5_06,
           "Застосовуються логічні обмеження доступу, пов'язані зі змінами в системі",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "CM-6",
        name: "НАЛАШТУВАННЯ КОНФІГУРАЦІЇ (CM-6)",
        text: "Параметри політик безпеки та їхні значення за замовчуванням жорстко зашиті в `erpuno.ex`. Компілятор генерує незмінний об'єктний файл, який гарантує виконання затверджених налаштувань під час роботи.",
        parameters: [
          %{default: true, name: :compile_time_config, type: :boolean}
        ]
      },
      %{
        id: "CM-7",
        name: "МІНІМАЛЬНО НЕОБХІДНА ФУНКЦІОНАЛЬНІСТЬ (CM-7)",
        text: "Управління конфігураціями та оновленнями (CM) здійснюється згідно з політиками ІСС. Вразливі компоненти оновлюються протягом 5 днів після виявлення в exploit-db. Конфігураційні файли зберігаються в зашифрованому вигляді.",
        parameters: [
          {:cm_7_a,
           "Система налаштована на забезпечення лише основні функції системи ",
           [type: :string, default: nil]},
          {:cm_7_b_01,
           "Використання функцій заборонено або обмежено",
           [type: :string, default: nil]},
          {:cm_7_b_02,
           "Використання порти заборонено або обмежено",
           [type: :string, default: nil]},
          {:cm_7_b_03,
           "Використання протоколи заборонено або обмежено",
           [type: :string, default: "TLS 1.3"]},
          {:cm_7_b_04,
           "Використання програмне забезпечення заборонено або обмежено",
           [type: :string, default: nil]},
          {:cm_7_b_05,
           "Використання служби заборонено або обмежено",
           [type: :string, default: nil]},
          {:cm_7_odp_01,
           "Визначено основні функції системи, необхідні для виконання місії",
           [type: :string, default: nil]},
          {:cm_7_odp_02,
           "Визначено функції, які необхідно заборонити або обмежити",
           [type: :string, default: nil]},
          {:cm_7_odp_03,
           "Визначено системні порти, які необхідно заборонити або обмежити",
           [type: :string, default: nil]},
          {:cm_7_odp_04,
           "Визначено протоколи, які необхідно заборонити або обмежити; CM-07_ODP[05] визначено програмне забезпечення, яке необхідно заборонити або обмежити",
           [type: :string, default: "TLS 1.3"]},
          {:cm_7_odp_06,
           "Визначено служби, які необхідно заборонити або обмежити",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "CM-7(1)",
        name: "МІНІМАЛЬНО НЕОБХІДНА ФУНКЦІОНАЛЬНІСТЬ - ПЕРІОДИЧНИЙ ПЕРЕГЛЯД (CM-7(1))",
        text: "Управління конфігураціями та оновленнями (CM) здійснюється згідно з політиками ІСС. Вразливі компоненти оновлюються протягом 5 днів після виявлення в exploit-db. Конфігураційні файли зберігаються в зашифрованому вигляді.",
        parameters: [
          {:cm_7_1_a,
           "Система переглядається частота для виявлення непотрібних та/або незахищених функцій, портів, протоколів і послуг",
           [type: :string, default: "TLS 1.3"]},
          {:cm_7_1_b_01,
           "Функції, які вважаються непотрібними та/або незахищеними, вимкнено",
           [type: :string, default: nil]},
          {:cm_7_1_b_02,
           "Порти, які вважаються непотрібними та/або незахищеними, вимкнено",
           [type: :string, default: nil]},
          {:cm_7_1_b_03,
           "Протоколи, які вважаються непотрібними та/або незахищеними, вимкнено",
           [type: :string, default: "TLS 1.3"]},
          {:cm_7_1_b_04,
           "Послуги, які вважаються непотрібними та/або незахищеними, вимкнено",
           [type: :string, default: nil]},
          {:cm_7_1_odp_01,
           "Визначено частоту, з якою слід переглядати систему для виявлення непотрібних та/або незахищених функцій, портів, протоколів і послуг",
           [type: :string, default: "TLS 1.3"]},
          {:cm_7_1_odp_02,
           "Визначено функції, які слід вимкнути, якщо вони вважаються непотрібними або незахищеними; CM-07(01)_ODP[03] визначено порти, які слід вимкнути, якщо вони вважаються непотрібними або незахищеними",
           [type: :string, default: nil]},
          {:cm_7_1_odp_04,
           "Визначено протоколи, які слід вимкнути, якщо вони вважаються непотрібними або незахищеними",
           [type: :string, default: "TLS 1.3"]},
          {:cm_7_1_odp_05,
           "Визначено послуги, які слід вимкнути, якщо вони вважаються непотрібними або незахищеними",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "CM-7(5)",
        name: "МІНІМАЛЬНО НЕОБХІДНА ФУНКЦІОНАЛЬНІСТЬ - АВТОРИЗОВАНЕ ПРОГРАМНЕ ЗАБЕЗПЕЧЕННЯ – БІЛИЙ СПИСОК (CM-7(5))",
        text: "Управління конфігураціями та оновленнями (CM) здійснюється згідно з політиками ІСС. Вразливі компоненти оновлюються протягом 5 днів після виявлення в exploit-db. Конфігураційні файли зберігаються в зашифрованому вигляді.",
        parameters: [
          {:cm_7_5_a,
           "Визначено програмне забезпечення",
           [type: :string, default: nil]},
          {:cm_7_5_b,
           "Політика \"заборонити все, дозволити за винятком\" застосовуэться, щоб дозволити виконання авторизованих програм у системі",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:cm_7_5_c,
           "Переглядається та оновлюється список авторизованих програм частота",
           [type: :list, default: []]},
          {:cm_7_5_odp_01,
           "Визначено програмне забезпечення, яке авторизовано для виконання в системі",
           [type: :string, default: nil]},
          {:cm_7_5_odp_02,
           "Визначено частоту перегляду та оновлення списку авторизованих програм",
           [type: :integer, default: 30]}
        ]
      },
      %{
        id: "CM-8",
        name: "ІНВЕНТАРИЗАЦІЯ КОМПОНЕНТІВ СИСТЕМИ (CM-8)",
        text: "Профіль автоматично фіксує перелік використовуваних компонентів системи (бібліотеки `synrc/kvs`, `synrc/ca` тощо) та їхні параметри, забезпечуючи інтегральну інвентаризацію модулів захисту.",
        parameters: [
          %{default: true, name: :component_inventory, type: :boolean}
        ]
      },
      %{
        id: "CM-8(1)",
        name: "ІНВЕНТАРИЗАЦІЯ КОМПОНЕНТІВ СИСТЕМИ - ОНОВЛЕННЯ ПІД ЧАС ВСТАНОВЛЕННЯ ТА ВИДАЛЕННЯ (CM-8(1))",
        text: "Управління конфігураціями та оновленнями (CM) здійснюється згідно з політиками ІСС. Вразливі компоненти оновлюються протягом 5 днів після виявлення в exploit-db. Конфігураційні файли зберігаються в зашифрованому вигляді.",
        parameters: [
          {:cm_8_1_01,
           "Інвентаризація компонентів системи оновлюється в рамках інсталяцій компонентів системи",
           [type: :string, default: nil]},
          {:cm_8_1_02,
           "Інвентаризація компонентів системи оновлюється в рамках видалення компонентів системи",
           [type: :string, default: nil]},
          {:cm_8_1_03,
           "Інвентаризація компонентів системи оновлюється в рамках оновлення компонентів системи",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "CM-12",
        name: "РОЗТАШУВАННЯ ІНФОРМАЦІЇ (CM-12)",
        text: "Управління конфігураціями та оновленнями (CM) здійснюється згідно з політиками ІСС. Вразливі компоненти оновлюються протягом 5 днів після виявлення в exploit-db. Конфігураційні файли зберігаються в зашифрованому вигляді.",
        parameters: [
          {:cm_12_a_01,
           "Місцезнаходження інформація визначено та задокументовано",
           [type: :string, default: nil]},
          {:cm_12_a_02,
           "Визначено та задокументовано конкретні компоненти системи, на яких обробляється інформація",
           [type: :string, default: nil]},
          {:cm_12_a_03,
           "Визначено та задокументовано конкретні компоненти системи, на яких зберігається інформація",
           [type: :string, default: nil]},
          {:cm_12_b_01,
           "Визначено та задокументовано користувачів, які мають доступ до системи та компонентів системи, де обробляється інформація",
           [type: :string, default: nil]},
          {:cm_12_b_02,
           "Визначено та задокументовано користувачів, які мають доступ до системи та компонентів системи, де зберігається інформація; CM-12(c)[01] задокументовано зміни розташування ( наприклад, системи або компонентів системи), де обробляється інформація",
           [type: :string, default: nil]},
          {:cm_12_c_02,
           "Задокументовано зміни розташування ( наприклад, системи або компонентів системи), де зберігається інформація",
           [type: :string, default: nil]},
          {:cm_12_odp,
           "Визначено інформацію, місцезнаходження якої має бути визначено та задокументовано",
           [type: :string, default: nil]}
        ]
      }
    ]
  },
  %{
    id: "CP",
    name: "ПЛАНУВАННЯ БЕЗПЕРЕРВНОЇ РОБОТИ (CP)",
    text: "Безперервність роботи та резервне копіювання забезпечується кластеризацією сховищ даних (LSM-дерева, реплікація PostgreSQL) та регулярним копіюванням БД і журналів згідно з політиками ЄСІКС.",
    subcontrols: [
      %{
        id: "CP-9",
        name: "РЕЗЕРВНЕ КОПІЮВАННЯ (CP-9)",
        text: "Система здійснює автоматичне створення резервних копій бази даних KVS. Бекапи можуть зберігатися локально або відправлятися до хмарних сховищ, гарантуючи відновлення даних відповідно до RTO/RPO.",
        parameters: [%{default: true, name: :system_backup, type: :boolean}]
      },
      %{
        id: "CP-9(8)",
        name: "РЕЗЕРВНЕ КОПІЮВАННЯ - КРИПТОГРАФІЧНИЙ ЗАХИСТ (CP-9(8))",
        text: "Безперервність роботи та резервне копіювання забезпечується кластеризацією сховищ даних (LSM-дерева, реплікація PostgreSQL) та регулярним копіюванням БД і журналів згідно з політиками ЄСІКС.",
        parameters: [
          {:cp_9_8_01,
           "Реалізовано криптографічні механізми для запобігання несанкціонованому розкриттю та зміні резервної інформації",
           [type: :string, default: "AES-256-GCM"]},
          {:cp_9_8_odp,
           "Визначено резервні копії інформації для захисту від несанкціонованого розкриття та змін",
           [type: :string, default: nil]}
        ]
      }
    ]
  },
  %{
    id: "IA",
    name: "ІДЕНТИФІКАЦІЯ ТА АВТЕНТИФІКАЦІЯ (IA)",
    text: "Ідентифікація та автентифікація в ЄСІКС вимагає обов'язкового використання КЕП на захищеному носії (ДСТУ 4145:2002) з форматом CAdES-X Long та SSO інтеграцією.",
    subcontrols: [
      %{
        id: "IA-1",
        name: "Політика та процедури ідентифікації та автентифікації (IA-1)",
        text: "Ідентифікація та автентифікація в ЄСІКС вимагає обов'язкового використання КЕП на захищеному носії (ДСТУ 4145:2002) з форматом CAdES-X Long та SSO інтеграцією.",
        parameters: [
          {:ia_1_a_01,
           "Розроблено та задокументовано політику ідентифікації та автентифікації",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ia_1_a_02,
           "Політика ідентифікації та автентифікації поширюється на персонал або ролі",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ia_1_a_03,
           "Розроблені та задокументовані процедури ідентифікації та автентифікації, що сприяють впровадженню політики ідентифікації та автентифікації, а також відповідні заходи ідентифікації та перевірки автентичності",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ia_1_b,
           "Посадова особа призначається для управління політикою та процедурами ідентифікації та автентифікації; IA-01(c)[01][01] переглядається та оновлюється поточна політика ідентифікації та автентифікації частота; IA-01(c)[01][02] переглядається та оновлюється поточна політика ідентифікації та автентифікації після подій; IA-01(c)[02][01] переглядаються та оновлюються поточні процедури ідентифікації та автентифікації частота; IA-01(c)[02][02] переглядаються та оновлюються поточні процедури ідентифікації та автентифікації після подій",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ia_1_odp_01,
           "Визначено персонал або ролі, на які поширюється політика ідентифікації та автентифікації",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ia_1_odp_02,
           "Визначено персонал або ролі, на які поширюються процедури ідентифікації та автентифікації",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ia_1_odp_03,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {рівень організації; рівень місії/бізнес-процесів; рівень системи}",
           [type: :string, default: nil]},
          {:ia_1_odp_04,
           "Визначено посадову особу, яка управляє політикою та процедурами ідентифікації та автентифікації",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ia_1_odp_05,
           "Визначено частоту, з якою переглядається та оновлюється поточна політика ідентифікації та автентифікації",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ia_1_odp_06,
           "Визначено події, які потребують перегляду та оновлення поточної політики ідентифікації та автентифікації",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ia_1_odp_07,
           "Визначено частоту, з якою переглядаються та оновлюються поточні процедури ідентифікації та автентифікації",
           [type: :integer, default: 30]},
          {:ia_1_odp_08,
           "Визначено події, які потребують перегляду та оновлення процедур ідентифікації та автентифікації",
           [type: :list, default: ["login", "logout", "failed_attempt"]]}
        ]
      },
      %{
        id: "IA-2",
        name: "ІДЕНТИФІКАЦІЯ ТА АВТЕНТИФІКАЦІЯ КОРИСТУВАЧІВ (IA-2)",
        text: "Ідентифікація та автентифікація в ЄСІКС вимагає обов'язкового використання КЕП на захищеному носії (ДСТУ 4145:2002) з форматом CAdES-X Long та SSO інтеграцією.",
        parameters: [%{default: true, name: :org_user_auth, type: :boolean}]
      },
      %{
        id: "IA-2(1)",
        name: "ІДЕНТИФІКАЦІЯ ТА АВТЕНТИФІКАЦІЯ (КОРИСТУВАЧІВ ОРГАНІЗАЦІЇ) - БАГАТОФАКТОРНА АВТЕНТИФІКАЦІЯ ПРИВІЛЕЙОВАНИХ ОБЛІКОВИХ ЗАПИСІВ (IA-2(1))",
        text: "Ідентифікація та автентифікація в ЄСІКС вимагає обов'язкового використання КЕП на захищеному носії (ДСТУ 4145:2002) з форматом CAdES-X Long та SSO інтеграцією.",
        parameters: [
          {:ia_2_1_01,
           "Реалізувано багатофакторну автентифікацію для доступу до привілейованих облікових записів",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "IA-2(2)",
        name: "ІДЕНТИФІКАЦІЯ ТА АВТЕНТИФІКАЦІЯ (КОРИСТУВАЧІВ ОРГАНІЗАЦІЇ) - БАГАТОФАКТОРНА АВТЕНТИФІКАЦІЯ НЕПРИВІЛЕЙОВАНИХ (IA-2(2))",
        text: "Ідентифікація та автентифікація в ЄСІКС вимагає обов'язкового використання КЕП на захищеному носії (ДСТУ 4145:2002) з форматом CAdES-X Long та SSO інтеграцією.",
        parameters: [
          {:ia_2_2_01,
           "Реалізовано багатофакторну автентифікацію для доступу до непривілейованих облікових записів",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "IA-2(8)",
        name: "Ідентифікація та автентифікація (користувачів організації) - Доступ до облікових записів — стійкість до відтворення (IA-2(8))",
        text: "Ідентифікація та автентифікація в ЄСІКС вимагає обов'язкового використання КЕП на захищеному носії (ДСТУ 4145:2002) з форматом CAdES-X Long та SSO інтеграцією.",
        parameters: [
          {:ia_2_8_odp,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {привілейовані облікові записи; непривілейовані облікові записи}",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "IA-2(12)",
        name: "ІДЕНТИФІКАЦІЯ ТА АВТЕНТИФІКАЦІЯ (КОРИСТУВАЧІВ ОРГАНІЗАЦІЇ) - ПРИЙНЯТТЯ ПОВНОВАЖЕНЬ ДЛЯ ВЕРИФІКАЦІЇ ОСОБИСТОЇ ІНФОРМАЦІЇ (PIV CREDENTIALS) (IA-2(12))",
        text: "Ідентифікація та автентифікація в ЄСІКС вимагає обов'язкового використання КЕП на захищеному носії (ДСТУ 4145:2002) з форматом CAdES-X Long та SSO інтеграцією.",
        parameters: [
          {:ia_2_12_01,
           "Приймаються та електронним шляхом підтверджуються повноваження облікових даних особистої ідентифікації",
           [type: :list, default: ["admin", "security_officer"]]}
        ]
      },
      %{
        id: "IA-3",
        name: "ІДЕНТИФІКАЦІЯ ТА АВТЕНТИФІКАЦІЯ ПРИСТРОЇВ (IA-3)",
        text: "Ідентифікація та автентифікація в ЄСІКС вимагає обов'язкового використання КЕП на захищеному носії (ДСТУ 4145:2002) з форматом CAdES-X Long та SSO інтеграцією.",
        parameters: [
          {:ia_3_odp_01,
           "Визначені пристрої та/або типи пристроїв, які повинні бути унікально ідентифіковані та автентифіковані перед установкою підключення",
           [type: :string, default: nil]},
          {:ia_3_odp_02,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {локальний; віддалений; мережевий}",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "IA-4",
        name: "УПРАВЛІННЯ ІДЕНТИФІКАЦІЄЮ (IA-4)",
        text: "Ідентифікація та автентифікація в ЄСІКС вимагає обов'язкового використання КЕП на захищеному носії (ДСТУ 4145:2002) з форматом CAdES-X Long та SSO інтеграцією.",
        parameters: [
          {:ia_4_a,
           "Управління ідентифікаторами здійснюється шляхом отримання дозволу від персоналу або ролей на призначення ідентифікатора особі, групі, ролі або пристрою",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ia_4_b,
           "Управління ідентифікаторами здійснюється шляхом вибору ідентифікатора, який ідентифікує окрему особу, групу, ролі або пристрій",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ia_4_c,
           "Управління ідентифікаторами здійснюється шляхом призначення ідентифікатора особі, групі, ролі або пристрою; IA-04(d) ідентифікатори управляються шляхом запобігання повторному використанню ідентифікаторів впродовж період часу",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ia_4_odp_01,
           "Визначено персонал або ролі, від яких необхідно отримати дозвіл на призначення ідентифікатора",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ia_4_odp_02,
           "Визначено період часу для запобігання повторному використанню ідентифікаторів",
           [type: :integer, default: 30]}
        ]
      },
      %{
        id: "IA-4(4)",
        name: "УПРАВЛІННЯ ІДЕНТИФІКАЦІЄЮ - ІДЕНТИФІКАЦІЯ СТАТУСУ КОРИСТУВАЧА (IA-4(4))",
        text: "Ідентифікація та автентифікація в ЄСІКС вимагає обов'язкового використання КЕП на захищеному носії (ДСТУ 4145:2002) з форматом CAdES-X Long та SSO інтеграцією.",
        parameters: [
          {:ia_4_4_01,
           "Управління індивідуальними ідентифікаторами, однозначно ідентифікуючи кожного індивідуума ознака, що ідентифікує індивідуальний статус",
           [type: :string, default: nil]},
          {:ia_4_4_odp,
           "Визначено ознаку, що ідентифікує індивідуальний статус",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "IA-5",
        name: "АВТЕНТИФІКАТОР УПРАВЛІННЯ",
        text: "Ідентифікація та автентифікація в ЄСІКС вимагає обов'язкового використання КЕП на захищеному носії (ДСТУ 4145:2002) з форматом CAdES-X Long та SSO інтеграцією.",
        parameters: [
          {:ia_5_a,
           "Управління системними автентифікаторами здійснюється шляхом перевірки, як частини початкового розподілу автентифікатора, особи, групи, ролі або пристрою, який отримує автентифікатор",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ia_5_b,
           "Управління системними автентифікаторами здійснюється шляхом створення вихідного вмісту автентифікатора для будь-яких автентифікаторів, виданих організацією",
           [type: :string, default: nil]},
          {:ia_5_c,
           "Управління системними автентифікаторами здійснюється шляхом забезпечення того, щоб автентифікатори мали достатню стійкість механізму для їх використання за призначенням; IA-05(d) управління системними автентифікаторами здійснюється шляхом створення та реалізація адміністративних процедур для первинного розповсюдження автентифікаторів, для втрачених/скомпрометованих або пошкоджених автентифікаторів, а також для відкликання автентифікаторів",
           [type: :string, default: nil]},
          {:ia_5_e,
           "Управління системними автентифікаторами здійснюється шляхом зміни типових автентифікаторів перед першим використанням",
           [type: :string, default: nil]},
          {:ia_5_f,
           "Управління системними автентифікаторами здійснюється шляхом зміни/оновлення автентифікаторів у встановлений період часу або коли відбуваються події",
           [type: :list, default: ["login", "logout", "failed_attempt"]]},
          {:ia_5_g,
           "Управління системними автентифікаторами здійснюється шляхом захисту вмісту автентифікатора від несанкціонованого розкриття та модифікацій",
           [type: :string, default: nil]},
          {:ia_5_h,
           "Управління системними автентифікаторами здійснюється шляхом вимоги до осіб, які використовують пристрої, використовувати спеціальні заходи безпеки для захисту автентифікаторів",
           [type: :string, default: nil]},
          {:ia_5_i,
           "Управління системними автентифікаторами здійснюється шляхом вимоги змінювати автентифікатори для облікових записів груп/ролей при зміні членства в цих облікових записах",
           [type: :string, default: nil]},
          {:ia_5_odp_01,
           "Визначено період часу для зміни або оновлення автентифікаторів за типом автентифікатора",
           [type: :integer, default: 30]}
        ]
      },
      %{
        id: "IA-5(1)",
        name: "УПРАВЛІННЯ АВТЕНТИФІКАТОРОМ - АВТЕНТИФІКАЦІЯ НА ОСНОВІ ПАРОЛЯ (IA-5(1))",
        text: "Ідентифікація та автентифікація в ЄСІКС вимагає обов'язкового використання КЕП на захищеному носії (ДСТУ 4145:2002) з форматом CAdES-X Long та SSO інтеграцією.",
        parameters: [
          {:ia_5_1_a,
           "Для автентифікації на основі паролів підтримується та оновлюється список часто використовуваних, очікуваних або скомпрометованих паролів частота, а також коли є підозра, що паролі організації були скомпрометовані прямо чи опосередковано",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ia_5_1_b,
           "Для автентифікації на основі паролів, коли паролі створюються або оновлюються користувачами, паролі перевіряються на відсутність у списку загальновживаних, очікуваних або скомпрометованих паролів в IA-05(01)(a)",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ia_5_1_c,
           "Для автентифікації на основі паролів, паролі передаються лише криптографічно захищеними каналами",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ia_5_1_d,
           "Для автентифікації на основі паролів паролі зберігаються за допомогою затвердженого алгоритму гешування, переважно використовуючи ключову геш-функцію",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ia_5_1_e,
           "Для автентифікації на основі пароля після відновлення облікового запису потрібно негайно вибрати новий пароль",
           [type: :string, default: nil]},
          {:ia_5_1_f,
           "Для автентифікації на основі пароля дозволяється вибір користувачем довгих паролів і фраз, що включають пробіли та всі друковані символи",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ia_5_1_g,
           "Для автентифікації на основі пароля використовуються автоматизовані інструменти, які допомагають користувачеві у виборі надійних автентифікаторів паролів",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ia_5_1_h,
           "Для автентифікації на основі пароля застосовуються склад та правила складності",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ia_5_1_odp_01,
           "Визначено частоту оновлення списку часто використовуваних, очікуваних або скомпрометованих паролів",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ia_5_1_odp_02,
           "Визначено склад та правила складності автентифікатора",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]}
        ]
      },
      %{
        id: "IA-5(2)",
        name: "УПРАВЛІННЯ АВТЕНТИФІКАТОРОМ - АВТЕНТИФІКАЦІЯ НА ОСНОВІ ВІДКРИТОГО КЛЮЧА (IA-5(2))",
        text: "Ідентифікація та автентифікація в ЄСІКС вимагає обов'язкового використання КЕП на захищеному носії (ДСТУ 4145:2002) з форматом CAdES-X Long та SSO інтеграцією.",
        parameters: []
      },
      %{
        id: "IA-5(11)",
        name: "УПРАВЛІННЯ АВТЕНТИФІКАТОРОМ - АВТЕНТИФІКАЦІЯ НА ОСНОВІ АПАРАТНИХ ТОКЕНІВ (IA-5(11))",
        text: "Ідентифікація та автентифікація в ЄСІКС вимагає обов'язкового використання КЕП на захищеному носії (ДСТУ 4145:2002) з форматом CAdES-X Long та SSO інтеграцією.",
        parameters: [
          {:ia_5_11_01,
           "УПРАВЛІННЯ АВТЕНТИФІКАТОРОМ - АВТЕНТИФІКАЦІЯ НА ОСНОВІ АПАРАТНИХ ТОКЕНІВ [Вилучено: Включено до ІА-02(01), ІА-02(02)]",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "IA-5(12)",
        name: "УПРАВЛІННЯ АВТЕНТИФІКАТОРОМ - ЕФЕКТИВНІСТЬ БІОМЕТРИЧНОЇ АВТЕНТИФІКАЦІЇ (IA-5(12))",
        text: "Ідентифікація та автентифікація в ЄСІКС вимагає обов'язкового використання КЕП на захищеному носії (ДСТУ 4145:2002) з форматом CAdES-X Long та SSO інтеграцією.",
        parameters: [
          {:ia_5_12_odp,
           "Визначено вимоги до якості біометрії; для біометричної автентифікації використовувати механізми, які задовольняють вимоги",
           [
             type: :string,
             default: "автоматизований засіб моніторингу"
           ]}
        ]
      },
      %{
        id: "IA-5(15)",
        name: "УПРАВЛІННЯ АВТЕНТИФІКАТОРОМ - ПРОДУКТИ ТА ПОСЛУГИ, ЗАТВЕРДЖЕНІ УПОВНОВАЖЕНИМ ОРГАНОМ (IA-5(15))",
        text: "Ідентифікація та автентифікація в ЄСІКС вимагає обов'язкового використання КЕП на захищеному носії (ДСТУ 4145:2002) з форматом CAdES-X Long та SSO інтеграцією.",
        parameters: [
          {:ia_5_15_01,
           "Використовуються лише схвалені та затверджені уповноваженим органом продукти та послуги",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "IA-5(17)",
        name: "УПРАВЛІННЯ АВТЕНТИФІКАТОРОМ - АВТОМАТИЗОВАНІ ЗАСОБИ ВИЯВЛЕННЯ АТАК ІЗ ВИКОРИСТАННЯМ БІОМЕТРИЧНИХ АВТЕНТИФІКАТОРІВ (IA-5(17))",
        text: "Ідентифікація та автентифікація в ЄСІКС вимагає обов'язкового використання КЕП на захищеному носії (ДСТУ 4145:2002) з форматом CAdES-X Long та SSO інтеграцією.",
        parameters: [
          {:ia_5_17_01,
           "Використовуються механізми виявлення атак із використанням штучно виготовлених артефактів для біометричних автентифікаторів",
           [
             type: :string,
             default: "автоматизований засіб моніторингу"
           ]}
        ]
      },
      %{
        id: "IA-6",
        name: "ПРИХОВУВАННЯ ЗВОРОТНОГО ЗВ'ЯЗКУ АВТЕНТИФІКАТОРА",
        text: "Ідентифікація та автентифікація в ЄСІКС вимагає обов'язкового використання КЕП на захищеному носії (ДСТУ 4145:2002) з форматом CAdES-X Long та SSO інтеграцією.",
        parameters: [
          {:ia_6_01,
           "Забезпечино приховану зворотну передачу інформації автентифікації в про- цесі автентифікації для забезпечення захисту інформації від можливої експлуатації та використання неавторизованими особами",
           [type: :list, default: ["admin", "security_officer"]]}
        ]
      },
      %{
        id: "IA-7",
        name: "АВТЕНТИФІКАЦІЯ КРИПТОГРАФІЧНОГО МОДУЛЯ (IA-7)",
        text: "Ідентифікація та автентифікація в ЄСІКС вимагає обов'язкового використання КЕП на захищеному носії (ДСТУ 4145:2002) з форматом CAdES-X Long та SSO інтеграцією.",
        parameters: [
          {:ia_7_01,
           "Впроваджено механізми автентифікації в криптографічний модуль, який відповідає вимогам чинних законів, виконавчих розпоряджень, директив, політик, правил, стандартів та рекомендацій для такої автентифікації",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]}
        ]
      },
      %{
        id: "IA-11",
        name: "ПОВТОРНА АВТЕНТИФІКАЦІЯ (IA-11)",
        text: "Ідентифікація та автентифікація в ЄСІКС вимагає обов'язкового використання КЕП на захищеному носії (ДСТУ 4145:2002) з форматом CAdES-X Long та SSO інтеграцією.",
        parameters: [
          {:ia_11_01,
           "Користувачі повинні повторно автентифікуватися, коли обставини або ситуації",
           [type: :string, default: nil]},
          {:ia_11_odp,
           "Визначено обставини або ситуації, що вимагають повторної автен- тифікації",
           [type: :string, default: nil]}
        ]
      }
    ]
  },
  %{
    id: "IR",
    name: "РЕАГУВАННЯ НА ІНЦИДЕНТИ (IR)",
    text: "Реагування на інциденти кібербезпеки узгоджується з централізованими процедурами ЄСІКС та адміністраторами ІСС.",
    subcontrols: [
      %{
        id: "IR-1",
        name: "Політика та процедури реагування на інциденти (IR-1)",
        text: "Політика реагування на інциденти закодована безпосередньо у бізнес-процесах (BPMN) `erpuno/itsm`, забезпечуючи неухильне виконання процедур на кожному кроці життєвого циклу інциденту.",
        parameters: [
          %{default: true, name: :incident_policy_enforcement, type: :boolean}
        ]
      },
      %{
        id: "IR-2",
        name: "НАВЧАННЯ З РЕАГУВАННЯ НА ІНЦИДЕНТИ (IR-2)",
        text: "Інтерфейс `erpuno/itsm` надає контекстні підказки та інструкції безпосередньо у формах обробки інцидентів, що виконує функцію інтерактивного навчання та підтримки персоналу в кризових ситуаціях.",
        parameters: [
          %{default: true, name: :incident_response_training, type: :boolean}
        ]
      },
      %{
        id: "IR-3",
        name: "ПЕРЕВІРКА РЕАГУВАНЬ НА ІНЦИДЕНТИ (IR-3)",
        text: "Можливості BPE-движка дозволяють запускати симуляції інцидентів у тестовому середовищі `itsm` для регулярного тестування планів реагування без впливу на продуктивну систему.",
        parameters: [
          %{default: true, name: :incident_testing_simulation, type: :boolean}
        ]
      },
      %{
        id: "IR-4",
        name: "Обробка інциденту (IR-4)",
        text: "Будь-який інцидент безпеки автоматично реєструється як тикет у модулі `itsm`. Процес обробки (`incident_management_process`) гарантує, що інцидент пройде всі необхідні етапи: виявлення, ізоляція, усунення, відновлення.",
        parameters: [%{default: true, name: :incident_handling, type: :boolean}]
      },
      %{
        id: "IR-5",
        name: "Моніторинг інциденту (IR-5)",
        text: "Статуси інцидентів у реальному часі відображаються на дашбордах `erpuno/itsm`. BPE-движок дозволяє призначати SLA-таймаути (Boundary Events) для ескалації інцидентів, якщо час реакції перевищено.",
        parameters: [
          %{default: true, name: :incident_monitoring, type: :boolean}
        ]
      },
      %{
        id: "IR-6",
        name: "ЗВІТНІСТЬ ПРО ІНЦИДЕНТИ (IR-6)",
        text: "Система `erpuno/itsm` автоматично формує звіти про інциденти, надаючи вичерпну інформацію про порушені сервіси, час простою (SLA) та дії команди, що закриває вимоги внутрішньої та зовнішньої звітності.",
        parameters: [
          %{default: true, name: :automated_incident_reporting, type: :boolean}
        ]
      },
      %{
        id: "IR-7",
        name: "ПІДТРИМКА РЕАГУВАННЯ НА ІНЦИДЕНТИ (IR-7)",
        text: "Вбудовані засоби комунікації в рамках тикету (коментарі, призначення експертів, інтеграція з базою знань) забезпечують оперативну допомогу та координацію групи безпеки під час інциденту.",
        parameters: [
          %{default: true, name: :incident_assistance, type: :boolean}
        ]
      },
      %{
        id: "IR-8",
        name: "План реагування на інциденти (IR-8)",
        text: "Сам конфігураційний код процесів `erpuno/itsm` виступає в ролі актуального та виконуваного плану реагування на інциденти (Executable Incident Response Plan), усуваючи розбіжність між документацією та реальністю.",
        parameters: [
          %{default: true, name: :executable_ir_plan, type: :boolean}
        ]
      }
    ]
  },
  %{
    id: "MA",
    name: "ТЕХНІЧНЕ ОБСЛУГОВУВАННЯ (MA)",
    text: "Технічне обслуговування компонентів ЄСІКС здійснюється авторизованим персоналом (ІСС) через безпечні канали з відповідним логуванням дій.",
    subcontrols: [
      %{
        id: "MA-1",
        name: "ПОЛІТИКА ТА ПРОЦЕДУРИ ТЕХНІЧНОГО ОБСЛУГОВУВАННЯ (MA-1)",
        text: "Технічне обслуговування компонентів ЄСІКС здійснюється авторизованим персоналом (ІСС) через безпечні канали з відповідним логуванням дій.",
        parameters: [
          {:ma_1_a_01,
           "Розроблено та задокументовано політику технічного обслуговування",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ma_1_a_02,
           "Політика технічного обслуговування поширюється на персонал або ролі",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ma_1_a_03,
           "Розроблені та задокументовані процедури технічного обслуговування, що сприяють впровадженню політики технічного обслуговування та пов'язаних з нею заходів технічного обслуговування",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ma_1_b,
           "Посадова особа призначається для управління розробкою, документуванням та розповсюдженням політики та процедур технічного обслуговування; MA-01(c)[01][01] переглядається та оновлюється поточна політика обслуговування частота; MA-01(c)[01][02] переглядається та оновлюється поточна політика обслуговування після подій; MA-01(c)[02][01] переглядаються та оновлюються поточні процедури технічного обслуговування частота; MA-01(c)[02][02] переглядаються та оновлюються поточні процедури технічного обслуговування після подій",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ma_1_odp_01,
           "Визначено персонал або ролі, на які поширюється політика технічного обслуговування",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ma_1_odp_02,
           "Визначено персонал або ролі, на які поширюються процедури технічного обслуговування",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ma_1_odp_03,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {рівень організації; рівень місії/бізнес-процесу; рівень системи}",
           [type: :string, default: nil]},
          {:ma_1_odp_04,
           "Визначено посадову особу, яка керуватиме політикою та процедурами технічного обслуговування",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ma_1_odp_05,
           "Визначено частоту, з якою переглядається та оновлюється поточна політика технічного обслуговування",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ma_1_odp_06,
           "Визначено події, які потребують перегляду та оновлення поточної політики технічного обслуговування",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ma_1_odp_07,
           "Визначено частоту, з якою переглядаються та оновлюються поточні процедури технічного обслуговування",
           [type: :integer, default: 30]},
          {:ma_1_odp_08,
           "Визначено події, які потребують перегляду та оновлення процедур технічного обслуговування",
           [type: :list, default: ["login", "logout", "failed_attempt"]]}
        ]
      },
      %{
        id: "MA-3",
        name: "ІНСТРУМЕНТИ ДЛЯ ОБСЛУГОВУВАННЯ (MA-3)",
        text: "Технічне обслуговування компонентів ЄСІКС здійснюється авторизованим персоналом (ІСС) через безпечні канали з відповідним логуванням дій.",
        parameters: [
          {:ma_3_a_01,
           "Використання засобів технічного обслуговування затверджено",
           [type: :string, default: nil]},
          {:ma_3_a_02,
           "Використання засобів технічного обслуговування контролюється",
           [type: :string, default: nil]},
          {:ma_3_a_03,
           "Використання засобів технічного обслуговування відстажуються",
           [type: :string, default: nil]},
          {:ma_3_b,
           "Переглядаються раніше затверджені інструменти технічного обслуговування частота",
           [type: :string, default: "щорічно"]},
          {:ma_3_odp,
           "Визначено частоту, з якою слід переглядати раніше затверджені інструменти технічного обслуговування",
           [type: :integer, default: 30]}
        ]
      },
      %{
        id: "MA-3(1)",
        name: "ІНСТРУМЕНТИ ДЛЯ ОБСЛУГОВУВАННЯ - ПЕРЕВІРКА ІНСТРУМЕНТІВ (MA-3(1))",
        text: "Технічне обслуговування компонентів ЄСІКС здійснюється авторизованим персоналом (ІСС) через безпечні канали з відповідним логуванням дій.",
        parameters: [
          {:ma_3_1_01,
           "Оглядаються інструменти для технічного обслуговування, які доставлені на об'єкт обслуговуючим персоналом, на предмет неправильних або несанкціонованих модифікацій",
           [type: :list, default: ["admin", "security_officer"]]}
        ]
      },
      %{
        id: "MA-3(2)",
        name: "ІНСТРУМЕНТИ ДЛЯ ОБСЛУГОВУВАННЯ - ПЕРЕВІРКА НОСІЇВ ІНФОРМАЦІЇ (MA-3(2))",
        text: "Технічне обслуговування компонентів ЄСІКС здійснюється авторизованим персоналом (ІСС) через безпечні канали з відповідним логуванням дій.",
        parameters: [
          {:ma_3_2_01,
           "Перед використанням носіїв у системі перевіряються носії, що містять діагностичні та тестові програми на наявність шкідливого коду",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "MA-3(3)",
        name: "ІНСТРУМЕНТИ ДЛЯ ОБСЛУГОВУВАННЯ - ЗАПОБІГАННЯ НЕСАНКЦІОНОВАНОМУ ПЕРЕМІЩЕННЮ (MA-3(3))",
        text: "Технічне обслуговування компонентів ЄСІКС здійснюється авторизованим персоналом (ІСС) через безпечні канали з відповідним логуванням дій.",
        parameters: [
          {:ma_3_3_a,
           "Переміщення обладнання для технічного обслуговування, що містить інформацію організації, запобігається шляхом перевірки того, що на обладнанні не міститься ніякої інформації організації; або",
           [type: :string, default: nil]},
          {:ma_3_3_b,
           "Переміщення обладнання для технічного обслуговування, що містить інформацію організації, запобігається шляхом очищення або знищення обладнання; або",
           [type: :string, default: nil]},
          {:ma_3_3_c,
           "Переміщення обладнання для технічного обслуговування, що містить інформацію організації, запобігається шляхом утримання обладнання на об'єкті; або",
           [type: :string, default: nil]},
          {:ma_3_3_d,
           "Переміщення обладнання для технічного обслуговування, що містить інформацію організації, запобігається шляхом отримання дозволу від персонал або ролі",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ma_3_3_odp,
           "Визначено персонал або ролі, які можуть надавати дозвіл на переміщення обладнання з об'єкту",
           [type: :list, default: ["admin", "security_officer"]]}
        ]
      },
      %{
        id: "MA-4",
        name: "ВІДДАЛЕНЕ ОБСЛУГОВУВАННЯ (MA-4)",
        text: "Технічне обслуговування компонентів ЄСІКС здійснюється авторизованим персоналом (ІСС) через безпечні канали з відповідним логуванням дій.",
        parameters: [
          {:ma_4_a_01,
           "Впроваджено віддалені дії з обслуговування та діагностики",
           [type: :list, default: ["login", "logout", "failed_attempt"]]},
          {:ma_4_a_02,
           "Відстежуються віддалені дії з обслуговування та діагностики",
           [type: :list, default: ["login", "logout", "failed_attempt"]]},
          {:ma_4_b_01,
           "Використання віддалених засобів технічного обслуговування та діагностики дозволено лише відповідно до політики організації",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ma_4_b_02,
           "Використання віддалених засобів технічного обслуговування та діагностики задокументовано в плані захисту інформації",
           [type: :string, default: nil]},
          {:ma_4_c,
           "Надійна автентифікація використовується при встановленні віддалених технічних та діагностичних сеансів",
           [type: :string, default: nil]},
          {:ma_4_d,
           "Ведеться облік віддалених дій з обслуговування та діагностики",
           [type: :string, default: nil]},
          {:ma_4_e_01,
           "Сесія припиняється, коли завершено віддалене обслуговування",
           [type: :string, default: nil]},
          {:ma_4_e_02,
           "Мережеве з’єднання припиняється, коли завершено віддалене обслуговування",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "MA-5",
        name: "ТЕХНІЧНИЙ ПЕРСОНАЛ (MA-5)",
        text: "Технічне обслуговування компонентів ЄСІКС здійснюється авторизованим персоналом (ІСС) через безпечні канали з відповідним логуванням дій.",
        parameters: [
          {:ma_5_a_01,
           "Запроваджено процес авторизації технічного персоналу",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ma_5_a_02,
           "Ведеться перелік авторизованих організацій або персоналу з технічного обслуговування",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ma_5_b,
           "Персонал без супроводу, який виконує технічне обслуговування системи, має необхідні дозволи на доступ",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ma_5_c,
           "Персонал організації з необхідними повноваженнями доступу та технічною компетентністю призначений/призначені для нагляду за діяльністю з технічного обслуговування персоналу, який не має необхідних дозволів на доступ",
           [type: :list, default: ["admin", "security_officer"]]}
        ]
      }
    ]
  },
  %{
    id: "MP",
    name: "ЗАХИСТ НОСІЇВ ІНФОРМАЦІЇ (MP)",
    text: "Криптографічні ключі та сертифікати зберігаються на захищених апаратних носіях (HSM) або в зашифрованих сховищах, доступ до яких обмежено.",
    subcontrols: [
      %{
        id: "MP-1",
        name: "ПОЛІТИКА ТА ПРОЦЕДУРИ ЩОДО ЗАХИСТУ НОСІЇВ ІНФОРМАЦІЇ (MP-1)",
        text: "Криптографічні ключі та сертифікати зберігаються на захищених апаратних носіях (HSM) або в зашифрованих сховищах, доступ до яких обмежено.",
        parameters: [
          {:mp_1_a_01,
           "Розроблено та задокументовано політику захисту носіїв інформації",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:mp_1_a_02,
           "Політика захисту носіїв інформації поширюється на персонал або ролі",
           [type: :list, default: ["admin", "security_officer"]]},
          {:mp_1_a_03,
           "Розроблено та задокументовано процедури захисту носіїв інформації, що сприятимуть реалізації політики захисту носіїв інформації та заходів захисту носіїв інформації",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:mp_1_b,
           "Посадова особа призначається для управління розробкою, документуванням та розповсюдженням політики та процедур захисту носіїв інформації. MP-01(c)[01][01] переглядається та оновлюється поточна політика захисту носіїв інформації частота; MP-01(c)[01][02] переглядається та оновлюється поточна політика захисту носіїв інформації після подій; MP-01(c)[02][01] переглядаються та оновлюються поточні процедури захисту носіїв інформації частота; MP-01(c)[02][02] переглядаються та оновлюються поточні процедури захисту носіїв інформації після подій",
           [type: :list, default: ["admin", "security_officer"]]},
          {:mp_1_odp_01,
           "Визначено персонал або ролі, серед яких має бути поширена політика захисту носіїв інформації",
           [type: :list, default: ["admin", "security_officer"]]},
          {:mp_1_odp_02,
           "Визначено персонал або ролі, серед яких мають бути поширені процедури захисту носіїв інформації",
           [type: :list, default: ["admin", "security_officer"]]},
          {:mp_1_odp_03,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {рівень організації; рівень місії/бізнес-процесу; рівень системи}",
           [type: :string, default: nil]},
          {:mp_1_odp_04,
           "Визначено посадову особу, яка керуватиме політикою та процедурами захисту носіїв інформації",
           [type: :list, default: ["admin", "security_officer"]]},
          {:mp_1_odp_05,
           "Визначено частоту, з якою переглядається та оновлюється поточна політика захисту носіїв інформації",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:mp_1_odp_06,
           "Визначено події, які потребують перегляду та оновлення чинної політики захисту носіїв інформації",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:mp_1_odp_07,
           "Визначено частоту, з якою переглядаються та оновлюються чинні процедури захисту носіїв інформації",
           [type: :integer, default: 30]},
          {:mp_1_odp_08,
           "Визначено події, які потребують перегляду та оновлення процедур захисту носіїв інформації",
           [type: :list, default: ["login", "logout", "failed_attempt"]]}
        ]
      },
      %{
        id: "MP-2",
        name: "ДОСТУП ДО НОСІЇВ ІНФОРМАЦІЇ (MP-2)",
        text: "Криптографічні ключі та сертифікати зберігаються на захищених апаратних носіях (HSM) або в зашифрованих сховищах, доступ до яких обмежено.",
        parameters: [
          {:mp_2_01,
           "Доступ до типів цифрових носіїв інформації обмежено для персоналу або ролей",
           [type: :list, default: ["admin", "security_officer"]]},
          {:mp_2_02,
           "Доступ до типів нецифрових носіїв інформації обмежено для персоналу або ролей",
           [type: :list, default: ["admin", "security_officer"]]},
          {:mp_2_odp_01,
           "Визначено типи цифрових носіїв інформації, доступ до яких обмежено",
           [type: :string, default: nil]},
          {:mp_2_odp_02,
           "Визначено персонал або ролі, уповноважені на доступ до цифрових носіїв інформації",
           [type: :list, default: ["admin", "security_officer"]]},
          {:mp_2_odp_03,
           "Визначено типи нецифрових носіїв інформації, доступ до яких обмежено",
           [type: :string, default: nil]},
          {:mp_2_odp_04,
           "Визначено персонал або ролі, уповноважені на доступ до нецифрових носіїв інформації",
           [type: :list, default: ["admin", "security_officer"]]}
        ]
      },
      %{
        id: "MP-3",
        name: "МАРКУВАННЯ НОСІЇВ ІНФОРМАЦІЇ (MP-3)",
        text: "Криптографічні ключі та сертифікати зберігаються на захищених апаратних носіях (HSM) або в зашифрованих сховищах, доступ до яких обмежено.",
        parameters: [
          {:mp_3_01,
           "МАРКУВАННЯ НОСІЇВ ІНФОРМАЦІЇ МЕТА ОЦІНКИ: Визначити, чи:",
           [type: :string, default: nil]},
          {:mp_3_a,
           "Носії інформації маркуються, щоб вказати на обмеження поширення, обробки, а також застереження та відповідні мітки безпеки (якщо такі є) інформації",
           [type: :string, default: nil]},
          {:mp_3_b,
           "Типи носіїв інформації залишаються в межах контрольованих зон",
           [type: :string, default: nil]},
          {:mp_3_odp_01,
           "Визначено типи носіїв інформації, які звільняються від маркування під час перебування на контрольованих зонах",
           [type: :integer, default: 30]},
          {:mp_3_odp_02,
           "Визначено контрольовані зони, де носії інформації звільняються від маркування",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "MP-4",
        name: "ЗБЕРІГАННЯ НОСІЇВ ІНФОРМАЦІЇ (MP-4)",
        text: "Криптографічні ключі та сертифікати зберігаються на захищених апаратних носіях (HSM) або в зашифрованих сховищах, доступ до яких обмежено.",
        parameters: [
          {:mp_4_a_01,
           "Типи цифрових носіїв контролюються фізично",
           [type: :string, default: nil]},
          {:mp_4_a_02,
           "Типи нецифрових носіїв контролюються фізично",
           [type: :string, default: nil]},
          {:mp_4_a_03,
           "Типи цифрових носіїв безпечно зберігаються в контрольованих зонах",
           [type: :string, default: nil]},
          {:mp_4_a_04,
           "Типи нецифрових носіїв безпечно зберігаються в контрольованих зонах",
           [type: :string, default: nil]},
          {:mp_4_b,
           "Типи носіїв інформації (визначені в MP-04_ODP[01], MP04_ODP[02], MP-04_ODP[03], MP-04_ODP[04]) захищені доти, доки носії інформації не будуть знищені або очищені за допомогою визначеного обладнання, методик та процедур",
           [type: :string, default: nil]},
          {:mp_4_odp_01,
           "Визначено типи цифрових носіїв інформації, які підлягають фізичному контролю (якщо вибрано)",
           [type: :string, default: nil]},
          {:mp_4_odp_02,
           "Визначено типи нецифрових носіїв інформації, які підлягають фізичному контролю (якщо вибрано)",
           [type: :string, default: nil]},
          {:mp_4_odp_03,
           "Визначено типи цифрових носіїв інформації для безпечного зберігання (якщо вибрано)",
           [type: :string, default: nil]},
          {:mp_4_odp_04,
           "Визначено типи нецифрових носіїв інформації для безпечного зберігання (якщо вибрано)",
           [type: :string, default: nil]},
          {:mp_4_odp_05,
           "Визначено контрольовані зони, в яких можна безпечно зберігати цифрові носії інформації; MP-04_ODP[06] визначено контрольовані зони, в яких можна безпечно зберігати нецифрові носії інформації",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "MP-5",
        name: "Транспортування носіїв інформації (MP-5)",
        text: "Криптографічні ключі та сертифікати зберігаються на захищених апаратних носіях (HSM) або в зашифрованих сховищах, доступ до яких обмежено.",
        parameters: [
          {:mp_5_a_01,
           "Типи носіїв інформації системи захищаються під час транспортування за межі контрольованих зон за допомогою заходів безпеки",
           [type: :integer, default: 30]},
          {:mp_5_a_02,
           "Типи носіїв інформації системи контролюються під час транспортування за межі контрольованих зон за допомогою заходів безпеки",
           [type: :integer, default: 30]},
          {:mp_5_b,
           "Під час транспортування за межі контрольованих зон ведеться облік носіїв інформації системи",
           [type: :integer, default: 30]},
          {:mp_5_c,
           "Діяльність, пов'язана з транспортуванням носіїв інформації системи, задокументована",
           [type: :string, default: nil]},
          {:mp_5_d_01,
           "Визначено персонал, уповноважений здійснювати діяльність з транспортування носіїв інформації",
           [type: :list, default: ["admin", "security_officer"]]},
          {:mp_5_d_02,
           "Діяльність, пов'язана з транспортуванням носіїв інформації системи, обмежується визначеним уповноваженим персоналом",
           [type: :list, default: ["admin", "security_officer"]]},
          {:mp_5_odp_01,
           "Визначено типи носіїв інформації системи для захисту та контролю під час транспортування за межі контрольованих зон",
           [type: :integer, default: 30]},
          {:mp_5_odp_02,
           "Визначено заходи безпеки, що використовуються для захисту носіїв інформації системи поза контрольованими зонами",
           [type: :string, default: nil]},
          {:mp_5_odp_03,
           "Визначено заходи безпеки, що використовуються для контролю носіїв інформації системи за межами контрольованих зон",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "MP-6",
        name: "ЗНИЩЕННЯ ІНФОРМАЦІЇ НА НОСІЯХ ІНФОРМАЦІЇ (MP-6)",
        text: "Криптографічні ключі та сертифікати зберігаються на захищених апаратних носіях (HSM) або в зашифрованих сховищах, доступ до яких обмежено.",
        parameters: [
          {:mp_6_a_01,
           "Носії інформації системи перед утилізацією піддаються очищенню за допомогою методів та процедур очищення",
           [type: :string, default: nil]},
          {:mp_6_a_02,
           "Носії інформації системи очищаються за допомогою методів та процедур очищення перед випуском за межі контрольованої зони",
           [type: :string, default: nil]},
          {:mp_6_a_03,
           "Носії інформації системи очищуються за допомогою методів і процедур очищення перед повторним використанням",
           [type: :string, default: nil]},
          {:mp_6_b,
           "Застосовуються механізми очищення, надійність і цілісність яких відповідає категорії безпеки або рівню секретності інформації",
           [
             type: :string,
             default: "автоматизований засіб моніторингу"
           ]},
          {:mp_6_odp_01,
           "Визначено носії інформації системи, які підлягають очищенню перед утилізацією",
           [type: :string, default: nil]},
          {:mp_6_odp_02,
           "Визначено носії інформації системи, які підлягають очищенню перед випуском за межі контрольованої зони",
           [type: :string, default: nil]},
          {:mp_6_odp_03,
           "Визначені носії інформації системи, що підлягають очищенню перед повторним використанням",
           [type: :string, default: nil]},
          {:mp_6_odp_04,
           "Визначено методи та процедури очищення, які слід використовувати для очищення перед утилізацією",
           [type: :string, default: nil]},
          {:mp_6_odp_05,
           "Визначено методи та процедури очищення, які слід використовувати для очищення перед випуском за межі контрольованої зони",
           [type: :string, default: nil]},
          {:mp_6_odp_06,
           "Визначено методи та процедури очищення, які слід використовувати для очищення перед повторним використанням",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "MP-7",
        name: "ВИКОРИСТАННЯ НОСІЇВ ІНФОРМАЦІЇ (MP-7)",
        text: "Криптографічні ключі та сертифікати зберігаються на захищених апаратних носіях (HSM) або в зашифрованих сховищах, доступ до яких обмежено.",
        parameters: [
          {:mp_7_01,
           "ВИКОРИСТАННЯ НОСІЇВ ІНФОРМАЦІЇ МЕТА ОЦІНКИ: Визначити, чи:",
           [type: :string, default: nil]},
          {:mp_7_b,
           "Використання зовнішніх носіїв інформації в системах організації заборонено, якщо такі пристрої не мають власника, якого можна ідентифікувати",
           [type: :string, default: nil]},
          {:mp_7_odp_01,
           "Визначено типи носіїв інформації, які мають бути обмежені або заборонені до використання в системі або компонентах системи",
           [type: :string, default: nil]},
          {:mp_7_odp_02,
           "Вибрано одне з наступних ЗНАЧЕНЬ ПАРАМЕТРА: {обмежити; заборонити}",
           [type: :string, default: nil]},
          {:mp_7_odp_03,
           "Системи або компоненти системи, для яких визначено використання певних типів носіїв інформації, що підлягають обмеженню або забороні",
           [type: :string, default: nil]},
          {:mp_7_odp_04,
           "Визначено заходи безпеки для обмеження або заборони використання певних типів носіїв інформації в системах або компонентах системи",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "MP-8(4)",
        name: "ЗНИЖЕННЯ КАТЕГОРІЇ БЕЗПЕКИ НОСІЇВ ІНФОРМАЦІЇ - ТАЄМНА ІНФОРМАЦІЯ (MP-8(4))",
        text: "Криптографічні ключі та сертифікати зберігаються на захищених апаратних носіях (HSM) або в зашифрованих сховищах, доступ до яких обмежено.",
        parameters: [
          {:mp_8_4_01,
           "Ідентифіковано носії інформації, що містять інформацію з обмеженим доступом",
           [type: :string, default: nil]},
          {:mp_8_4_02,
           "Носії інформації, що містять інформацію з обмеженим доступом, знижуються в класі перед передачею особам, які не мають необхідних дозволів на доступ",
           [type: :list, default: ["admin", "security_officer"]]}
        ]
      }
    ]
  },
  %{
    id: "PE",
    name: "ФІЗИЧНИЙ ЗАХИСТ ТА ЗАХИСТ НАВКОЛИШНЬОГО СЕРЕДОВИЩА (PE)",
    text: "Фізичний захист серверного обладнання та носіїв інформації забезпечується центрами обробки даних (ЦОД) ЄСІКС з багаторівневим контролем доступу.",
    subcontrols: [
      %{
        id: "PE-1",
        name: "РЕ-1 фізичного захисту та захисту робочого середовища Авторизація фізичного (PE-1)",
        text: "Фізичний захист серверного обладнання та носіїв інформації забезпечується центрами обробки даних (ЦОД) ЄСІКС з багаторівневим контролем доступу.",
        parameters: [
          {:pe_1_a_01,
           "Розроблено та задокументовано політику фізичного захисту та захисту робочого середовища",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:pe_1_a_02,
           "Політика фізичного захисту та захисту робочого середовища розповсюджується серед персоналу або ролей",
           [type: :list, default: ["admin", "security_officer"]]},
          {:pe_1_b,
           "Посадова особа призначається для управління розробкою, документуванням та розповсюдженням політики та процедур фізичного захисту та захисту робочого середовища; PE-01(c)[01][01] переглядається та оновлюється поточна політика фізичного захисту та захисту робочого середовища частота; PE-01(c)[01][02] поточна політика фізичного захисту та захисту робочого середовища переглядається та оновлюється після подій; PE-01(c)[02][01] переглядаються та оновлюються поточні процедури фізичного захисту та захисту робочого середовища частота; поточні процедури фізичного та екологічного захисту переглядаються та оновлюються після подій. PE-01(c)[02][02]",
           [type: :list, default: ["admin", "security_officer"]]},
          {:pe_1_odp_01,
           "Визначено персонал або ролі, до яких має бути доведена політика фізичного захисту та захисту робочого середовища",
           [type: :list, default: ["admin", "security_officer"]]},
          {:pe_1_odp_02,
           "Визначено персонал або ролі, на які поширюються процедури фізичного захисту та захисту робочого середовища",
           [type: :list, default: ["admin", "security_officer"]]},
          {:pe_1_odp_03,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {рівень організації; рівень місії/бізнес-процесу; рівень системи}",
           [type: :string, default: nil]},
          {:pe_1_odp_04,
           "Визначено посадову особу, яка керуватиме політикою та процедурами фізичного захисту та захисту робочого середовища",
           [type: :list, default: ["admin", "security_officer"]]},
          {:pe_1_odp_05,
           "Визначено частоту, з якою переглядається та оновлюється поточна політика фізичного захисту та захисту робочого середовища",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:pe_1_odp_06,
           "Визначено події, які потребують перегляду та оновлення поточної політики фізичного захисту та захисту робочого середовища",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:pe_1_odp_07,
           "Визначено частоту, з якою переглядаються та оновлюються поточні процедури фізичного захисту та захисту робочого середовища",
           [type: :integer, default: 30]},
          {:pe_1_odp_08,
           "Визначено події, які потребують перегляду та оновлення процедур фізичного захисту та захисту робочого середовища",
           [type: :list, default: ["login", "logout", "failed_attempt"]]}
        ]
      },
      %{
        id: "PE-2",
        name: "РЕ-2 доступу (PE-2)",
        text: "Регламентується інструкціями з режиму ЦОД (див. розділ PE у digital-profile.pdf).",
        parameters: [
          %{
            default: "digital-profile.pdf",
            name: :physical_access_doc_ref,
            type: :string
          }
        ]
      },
      %{
        id: "PE-3",
        name: "ФІЗИЧНИЙ ДОСТУП ДО СИСТЕМИ",
        text: "Регламентується системами СКУД будівлі (див. розділ PE у digital-profile.pdf).",
        parameters: [
          %{
            default: "digital-profile.pdf",
            name: :physical_access_control_ref,
            type: :string
          }
        ]
      },
      %{
        id: "PE-4",
        name: "РЕ-4 ліній електроживлення (PE-4)",
        text: "Фізичний захист серверного обладнання та носіїв інформації забезпечується центрами обробки даних (ЦОД) ЄСІКС з багаторівневим контролем доступу.",
        parameters: [
          {:pe_4_01,
           "Фізичний доступ до систем розподілу та постачання живлення в межах об'єктів організації контролюється за допомогою заходів захисту",
           [type: :string, default: nil]},
          {:pe_4_odp_01,
           "Визначені системи розподілу та постачання живлення, які потребують фізичного контролю доступу",
           [type: :string, default: nil]},
          {:pe_4_odp_02,
           "Визначено заходи захисту, які необхідно впровадити для контролю фізичного доступу до систем розподілу та постачання живлення в межах об'єкту організації",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "PE-5",
        name: "КОНТРОЛЬ ДОСТУПУ В ПРИМІЩЕННЯ ДЛЯ ВІДОБРАЖЕННЯ ІНФОРМАЦІЇ",
        text: "Фізичний захист серверного обладнання та носіїв інформації забезпечується центрами обробки даних (ЦОД) ЄСІКС з багаторівневим контролем доступу.",
        parameters: [
          {:pe_5_odp,
           "Визначено пристрої для виведення інформації над якими необхідний контроль над фізичним доступом до вихідних даних",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "PE-6",
        name: "МОНІТОРИНГ ФІЗИЧНОГО ДОСТУПУ",
        text: "Фізичний захист серверного обладнання та носіїв інформації забезпечується центрами обробки даних (ЦОД) ЄСІКС з багаторівневим контролем доступу.",
        parameters: [
          {:pe_6_a,
           "Фізичний доступ до об'єкту, де знаходиться система, моніториться з метою виявлення та реагування на інциденти фізичної безпеки",
           [type: :string, default: nil]},
          {:pe_6_b_01,
           "Переглядаються журнали фізичного доступу частота",
           [type: :string, default: "щорічно"]},
          {:pe_6_b_02,
           "Журнали фізичного доступу переглядаються при виникненні подій",
           [type: :string, default: nil]},
          {:pe_6_c_01,
           "Результати переглядів узгоджуються з можливостями організації щодо реагування на інциденти",
           [type: :string, default: nil]},
          {:pe_6_c_02,
           "Результати розслідувань узгоджуються з можливостями організації щодо реагування на інциденти",
           [type: :string, default: nil]},
          {:pe_6_odp_01,
           "Визначено частоту перегляду журналів фізичного доступу",
           [type: :integer, default: 30]},
          {:pe_6_odp_02,
           "Визначено події або потенційні ознаки подій, що вимагають перегляду журналів фізичного доступу",
           [type: :list, default: ["login", "logout", "failed_attempt"]]}
        ]
      },
      %{
        id: "PE-17",
        name: "АЛЬТЕРНАТИВНЕ РОБОЧЕ МІСЦЕ (PE-17)",
        text: "Фізичний захист серверного обладнання та носіїв інформації забезпечується центрами обробки даних (ЦОД) ЄСІКС з багаторівневим контролем доступу.",
        parameters: [
          {:pe_17_odp_01,
           "Визначені альтернативні робочі місця, дозволені для використання працівниками",
           [type: :string, default: nil]},
          {:pe_17_odp_02,
           "Визначаються заходи захисту, які будуть застосовуватися на альтернативних робочих місцях; РЕ-17(a) альтернативні робочі місця визначені та задокументовані; РЕ-17(b) заходи захисту впроваджені на альтернативних робочих місцях; РЕ-17(c) оцінюється ефективність заходів захисту на альтернативних робочих місцях; РЕ-17(d) працівникам надаються засоби комунікації з персоналом служби інформаційної безпеки на випадок інцидентів",
           [type: :list, default: ["admin", "security_officer"]]}
        ]
      },
      %{
        id: "PE-22",
        name: "МАРКУВАННЯ КОМПОНЕНТІВ (PE-22)",
        text: "Фізичний захист серверного обладнання та носіїв інформації забезпечується центрами обробки даних (ЦОД) ЄСІКС з багаторівневим контролем доступу.",
        parameters: [
          {:pe_22_01,
           "Апаратні компоненти системи позначаються із зазначенням рівня впливу або класифікації інформації, яку дозволено обробляти, зберігати або передавати за допомогою апаратного компонента",
           [type: :string, default: nil]},
          {:pe_22_odp,
           "Визначено апаратні компоненти системи, які підлягають маркуванню із зазначенням рівня впливу або класифікації інформації, яку дозволено обробляти, зберігати або передавати за допомогою апаратного компонента",
           [type: :string, default: nil]}
        ]
      }
    ]
  },
  %{
    id: "PL",
    name: "ПЛАНУВАННЯ (PL)",
    text: "Планування архітектури та безпеки базується на методології ISO/IEC/IEEE 42010, фреймворку Закмана та ДСТУ.",
    subcontrols: [
      %{
        id: "PL-1",
        name: "ПОЛІТИКИ ТА ПРОЦЕДУРИ ПЛАНУВАННЯ БЕЗПЕКИ (PL-1)",
        text: "Планування архітектури та безпеки базується на методології ISO/IEC/IEEE 42010, фреймворку Закмана та ДСТУ.",
        parameters: [
          {:pl_1_odp_01,
           "Визначено персонал або ролі, до яких має бути доведена політика планування безпеки",
           [type: :list, default: ["admin", "security_officer"]]},
          {:pl_1_odp_02,
           "Визначено персонал або ролі, на які поширюватимуться процедури планування безпеки",
           [type: :list, default: ["admin", "security_officer"]]},
          {:pl_1_odp_03,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {рівень організації; рівень місії/бізнеспроцесу; рівень системи}",
           [type: :string, default: nil]},
          {:pl_1_odp_04,
           "Визначено посадову особу, яка керуватиме політикою та процедурами планування безпеки",
           [type: :list, default: ["admin", "security_officer"]]},
          {:pl_1_odp_05,
           "Визначено періодичність перегляду та оновлення поточної політики планування безпеки",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:pl_1_odp_06,
           "Є події, які потребують перегляду та оновлення поточної політики планування безпеки",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:pl_1_odp_07,
           "Визначена частота, з якою переглядаються та оновлюються поточні процедури планування безпеки",
           [type: :string, default: "щорічно"]}
        ]
      },
      %{
        id: "PL-2",
        name: "ПЛАНИ ЗАХИСТУ ІНФОРМАЦІЇ ТА ПЕРСОНАЛЬНИХ ДАНИХ (PL-2)",
        text: "Планування архітектури та безпеки базується на методології ISO/IEC/IEEE 42010, фреймворку Закмана та ДСТУ.",
        parameters: [
          %{default: true, name: :system_security_plan, type: :boolean}
        ]
      },
      %{
        id: "PL-4",
        name: "ПРАВИЛА ПОВЕДІНКИ (PL-4)",
        text: "Планування архітектури та безпеки базується на методології ISO/IEC/IEEE 42010, фреймворку Закмана та ДСТУ.",
        parameters: [%{default: true, name: :rules_of_behavior, type: :boolean}]
      }
    ]
  },
  %{
    id: "PS",
    name: "БЕЗПЕКА ПЕРСОНАЛУ (PS)",
    text: "Вимоги до безпеки персоналу визначаються політиками управління кадрами та процедурами допуску до інформації в системі ЄСІКС.",
    subcontrols: [
      %{
        id: "PS-1",
        name: "Політика та процедури кадрової безпеки (PS-1)",
        text: "Вимоги до безпеки персоналу визначаються політиками управління кадрами та процедурами допуску до інформації в системі ЄСІКС.",
        parameters: [
          {:ps_1_odp_01,
           "Визначено персонал або ролі, на які поширюється політика кадрової безпеки",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ps_1_odp_02,
           "Визначено персонал або ролі, на які поширюються процедури кадрової безпеки",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ps_1_odp_03,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {рівень організації; рівень місії/бізнеспроцесу; рівень системи}",
           [type: :string, default: nil]},
          {:ps_1_odp_04,
           "Визначено посадову особу, яка керуватиме політикою та процедурами кадрової безпеки",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ps_1_odp_05,
           "Визначена періодичність перегляду та оновлення поточної політики кадрової безпеки",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ps_1_odp_06,
           "Є події, які вимагають перегляду та оновлення поточної політики кадрової безпеки",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ps_1_odp_07,
           "Визначено періодичність перегляду та оновлення поточних процедур кадрової безпеки",
           [type: :string, default: "щорічно"]}
        ]
      },
      %{
        id: "PS-3",
        name: "Перевірка персоналу (PS-3)",
        text: "Вимоги до безпеки персоналу визначаються політиками управління кадрами та процедурами допуску до інформації в системі ЄСІКС.",
        parameters: [
          {:ps_3_odp_01,
           "Визначені умови, що вимагають повторної перевірки осіб",
           [type: :list, default: []]},
          {:ps_3_odp_02,
           "Визначена частота повторної перевірки осіб, для яких це показано; PS-03a. проходять особи перевірку перед тим, як надати їм доступ до системи; PS-03b.[01] проходять особи повторну перевірку відповідно до умови, що вимагають повторної перевірки; PS-03b.[02] проводиться повторна перевірка у випадках, коли це зазначено, частота",
           [type: :list, default: ["admin", "security_officer"]]}
        ]
      },
      %{
        id: "PS-4",
        name: "Звільнення персоналу (PS-4)",
        text: "Вимоги до безпеки персоналу визначаються політиками управління кадрами та процедурами допуску до інформації в системі ЄСІКС.",
        parameters: [
          {:ps_4_odp_01,
           "Визначено період часу, протягом якого забороняється доступ до системи",
           [type: :integer, default: 30]},
          {:ps_4_odp_02,
           "Визначені теми інформаційної безпеки для обговорення під час проведення співбесід; PS-04a. при звільненні працівника доступ до системи вимикається протягом часового періоду; PS-04b. припиняють дію або анулюють будь-які автентифікатори та облікові дані після припинення трудових відносин з окремими особами; PS-04c. проводяться при звільненні окремих працівників співбесіди, які включають обговорення питань інформаційної безпеки; PS-04d. отримується після звільнення особи все майно, пов'язане з безпекою організаційної системи; PS-04e. зберігається доступ до організаційної інформації та систем, які раніше перебували під контролем особи, що звільняється, після припинення нею трудових відносин",
           [type: :list, default: ["admin", "security_officer"]]}
        ]
      },
      %{
        id: "PS-5",
        name: "Переведення персоналу (PS-5)",
        text: "Вимоги до безпеки персоналу визначаються політиками управління кадрами та процедурами допуску до інформації в системі ЄСІКС.",
        parameters: [
          {:ps_5_odp_01,
           "Визначені дії, які мають бути ініційовані після переведення або перепризначення",
           [type: :list, default: ["login", "logout", "failed_attempt"]]},
          {:ps_5_odp_02,
           "Визначено період часу, протягом якого мають бути здійснені дії з переведення або перепризначення після переведення або перепризначення",
           [type: :list, default: ["login", "logout", "failed_attempt"]]},
          {:ps_5_odp_03,
           "Визначено персонал або ролі, про які необхідно повідомляти, коли осіб призначають на інші посади або переводять на інші посади в організації",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ps_5_odp_04,
           "Визначено період часу, протягом якого необхідно повідомляти визначений організацією персонал або ролі, коли осіб перепризначають або переводять на інші посади в межах організації; PS-05a. переглядаються та підтверджуються поточні потреби в логічних та фізичних дозволах на доступ до систем та об'єктів при перепризначенні або переведенні осіб на інші посади в організації; PS-05b. були ініційовані дії з переведення або перепризначення протягом періоду часу після формальної дії з переведення; PS-05c. змінюється авторизація доступу за необхідності, щоб відповідати будь-яким змінам в оперативних потребах у зв'язку з перепризначенням або переведенням; PS-05d. було повідомлено персонал або ролі протягом часового періоду",
           [type: :list, default: ["admin", "security_officer"]]}
        ]
      }
    ]
  },
  %{
    id: "RA",
    name: "ОЦІНКА РИЗИКІВ (RA)",
    text: "Оцінка ризиків здійснюється з урахуванням вимог OWASP Top 10 та чинного законодавства України з кібербезпеки.",
    subcontrols: [
      %{
        id: "RA-1",
        name: "ПОЛІТИКА ТА ПРОЦЕДУРИ ОЦІНЮВАННЯ РИЗИКУ (RA-1)",
        text: "Оцінка ризиків здійснюється з урахуванням вимог OWASP Top 10 та чинного законодавства України з кібербезпеки.",
        parameters: [
          {:ra_1_odp_01,
           "Визначено персонал або ролі, на які поширюється політика оцінювання ризику",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ra_1_odp_02,
           "Визначено персонал або ролі, на які поширюються процедури, що сприяють здійсненню політики оцінювання ризику",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ra_1_odp_03,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {рівень організації; рівень місії/бізнеспроцесу; рівень системи}",
           [type: :string, default: nil]},
          {:ra_1_odp_04,
           "Визначена посадова особа, відповідальна за управління політикою та процедурами оцінювання ризику",
           [type: :list, default: ["admin", "security_officer"]]},
          {:ra_1_odp_05,
           "Визначена періодичність перегляду та оновлення поточної політики оцінювання ризику",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ra_1_odp_06,
           "Є події, які вимагають перегляду та оновлення поточної політики оцінювання ризику",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:ra_1_odp_07,
           "Визначено періодичність перегляду поточних процедур оцінювання ризику",
           [type: :string, default: "щорічно"]}
        ]
      },
      %{
        id: "RA-3",
        name: "ОЦІНЮВАННЯ РИЗИКУ (RA-3)",
        text: "Всі ідентифіковані вразливості або загрози фіксуються в реєстрі `itsm`, де їм присвоюється рівень критичності. На базі цього рівня розраховується пріоритет та призначаються відповідальні особи.",
        parameters: [%{default: true, name: :risk_assessment, type: :boolean}]
      },
      %{
        id: "RA-3(1)",
        name: "ОЦІНЮВАННЯ ПОСТАЧАННЯ (RA-3(1))",
        text: "Оцінка ризиків здійснюється з урахуванням вимог OWASP Top 10 та чинного законодавства України з кібербезпеки.",
        parameters: [
          {:ra_3_1_a,
           "Оцінювання ризику ланцюга постачання, пов'язані з системами, системними компонентами та системними послугами",
           [type: :string, default: nil]},
          {:ra_3_1_b,
           "Потрібно оновлювати оцінювання ризику ланцюга постачання, коли відбуваються значні зміни у відповідному ланцюгу постачання, або коли зміни в системі, середовищі функціонування чи інших умовах можуть вимагати змін у ланцюгу постачання",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "RA-5",
        name: "СКАНУВАННЯ ВРАЗЛИВОСТЕЙ (RA-5)",
        text: "Система передбачає можливість інтеграції зовнішніх сканерів вразливостей, звіти яких автоматично перетворюються на тикети усунення ризиків в системі `itsm`.",
        parameters: [
          %{default: true, name: :vulnerability_scanning, type: :boolean}
        ]
      },
      %{
        id: "RA-5(2)",
        name: "СКАНУВАННЯ ВРАЗЛИВОСТЕЙ - ОНОВЛЕННЯ ЗА ЧАСТОТОЮ, ПЕРЕД НОВИМ СКАНУВАННЯМ АБО ПРИ ІДЕНТИФІКАЦІЇ (RA-5(2))",
        text: "Оцінка ризиків здійснюється з урахуванням вимог OWASP Top 10 та чинного законодавства України з кібербезпеки.",
        parameters: [
          {:ra_5_2_01,
           "Визначено час реагування на усунення законних вразливостей відповідно до організаційної оцінення ризику",
           [type: :integer, default: 30]}
        ]
      },
      %{
        id: "RA-7",
        name: "РЕАГУВАННЯ НА РИЗИК (RA-7)",
        text: "Оцінка ризиків здійснюється з урахуванням вимог OWASP Top 10 та чинного законодавства України з кібербезпеки.",
        parameters: [
          {:ra_7_01,
           "Вживаються заходи реагування на результати оцінок безпеки відповідно до організаційної толерантності до ризиків",
           [type: :string, default: nil]},
          {:ra_7_02,
           "Вживаються заходи реагування на результати оцінювання приватності відповідно до організаційної толерантності до ризиків",
           [type: :string, default: nil]},
          {:ra_7_03,
           "Вживаються заходи реагування на результати моніторингу відповідно до організаційної толерантності до ризиків",
           [type: :string, default: nil]},
          {:ra_7_04,
           "Вживаються заходи реагування на висновки аудиту відповідно до організаційної толерантності до ризиків",
           [type: :string, default: nil]}
        ]
      }
    ]
  },
  %{
    id: "SA",
    name: "ПРИДБАННЯ СИСТЕМ ТА ПОСЛУГ (SA)",
    text: "Інтеграція нових підсистем (SA) вимагає використання open-source компонентів та безкоштовного ПЗ, сумісного з мікросервісною архітектурою та стандартами ЄСІКС.",
    subcontrols: [
      %{
        id: "SA-1",
        name: "ПОЛІТИКИ ТА ПРОЦЕДУРИ ПРИДБАННЯ СИСТЕМ ТА ПОСЛУГ (SA-1)",
        text: "Інтеграція нових підсистем (SA) вимагає використання open-source компонентів та безкоштовного ПЗ, сумісного з мікросервісною архітектурою та стандартами ЄСІКС.",
        parameters: [
          {:sa_1_odp_01,
           "Визначено персонал або ролі, на які поширюватиметься політика придбання систем і послуг",
           [type: :list, default: ["admin", "security_officer"]]},
          {:sa_1_odp_02,
           "Визначено персонал або ролі, на які поширюються процедури придбання систем і послуг",
           [type: :list, default: ["admin", "security_officer"]]},
          {:sa_1_odp_03,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {рівень організації; рівень місії/бізнеспроцесу; рівень системи}",
           [type: :string, default: nil]},
          {:sa_1_odp_04,
           "Визначено посадову особу, яка керуватиме політикою та процедурами придбання систем і послуг",
           [type: :list, default: ["admin", "security_officer"]]},
          {:sa_1_odp_05,
           "Визначено періодичність перегляду та оновлення поточної політики придбання систем і послуг",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:sa_1_odp_06,
           "Є події, які вимагають перегляду та оновлення поточної політики придбання систем і послуг",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:sa_1_odp_07,
           "Визначено частоту, з якою переглядаються та оновлюються поточні процедури придбання систем і послуг",
           [type: :integer, default: 30]}
        ]
      },
      %{
        id: "SA-8",
        name: "БЕЗПЕКА ТА ПРИВАТНІСТЬ ПРИНЦИПІВ ІНЖИНІРИНГУ (SA-8)",
        text: "Інтеграція нових підсистем (SA) вимагає використання open-source компонентів та безкоштовного ПЗ, сумісного з мікросервісною архітектурою та стандартами ЄСІКС.",
        parameters: [
          {:sa_8_01,
           "Застосовуються принципи інжинірингу безпеки систем у специфікації системи та компонентів системи",
           [type: :string, default: nil]},
          {:sa_8_02,
           "Застосовуються принципи інжинірингу безпеки систем при розробці системи та її компонентів",
           [type: :string, default: nil]},
          {:sa_8_03,
           "Були застосовані принципи інжинірингу безпеки систем при розробці системи та компонентів систем",
           [type: :string, default: nil]},
          {:sa_8_04,
           "Застосовуються принципи інжинірингу безпеки систем при реалізації системи та компонентів систем",
           [type: :string, default: nil]},
          {:sa_8_05,
           "Застосовуються принципи інжинірингу безпеки систем при модифікації системи та компонентів систем",
           [type: :string, default: nil]},
          {:sa_8_06,
           "Застосовуються принципи інжинірингу конфіденційності у специфікації системи та компонентів систем; принципи інжинірингу конфіденційності SA-08[07] застосовуються принципи інжинірингу конфіденційності при розробці системи та компонентів систем",
           [type: :string, default: nil]},
          {:sa_8_08,
           "Застосовуються принципи інжинірингу конфіденційності при розробці системи та компонентів систем",
           [type: :string, default: nil]},
          {:sa_8_09,
           "Застосовуються принципи інжинірингу конфіденційності при реалізації системи та компонентів систем",
           [type: :string, default: nil]},
          {:sa_8_10,
           "Застосовуються принципи інжинірингу конфіденційності при модифікації системи та компонентів систем",
           [type: :string, default: nil]},
          {:sa_8_odp_01,
           "Визначені принципи інжинірингу безпеки систем",
           [type: :string, default: nil]},
          {:sa_8_odp_02, "Визначені системи",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "SA-9",
        name: "ЗОВНІШНІ ПОСЛУГИ ДЛЯ СИСТЕМИ (SA-9)",
        text: "Інтеграція нових підсистем (SA) вимагає використання open-source компонентів та безкоштовного ПЗ, сумісного з мікросервісною архітектурою та стандартами ЄСІКС.",
        parameters: [
          {:sa_9_odp_01,
           "Визначені засоби контролю, які будуть застосовуватися зовнішніми постачальниками системних послуг",
           [
             type: :string,
             default: "автоматизований засіб моніторингу"
           ]},
          {:sa_9_odp_02,
           "Визначені процеси, методи та техніки, що застосовуються для моніторингу дотримання вимог контролю зовнішніми постачальниками послуг; SA-09a.[01] дотримуються постачальники зовнішніх системних послуг вимог організаційної безпеки; SA-09a.[02] дотримуються постачальники зовнішніх системних послуг вимог приватності організації; SA-09a.[03] використовують постачальники зовнішніх системних послуг елементи керування; SA-09b.[01] визначено та задокументовано організаційний нагляд за зовнішніми системними послугами; SA-09b.[02] визначені та задокументовані ролі та обов'язки користувачів щодо зовнішніх системних сервісів; SA-09c. визначені та задокументовані ролі та обов'язки користувачів щодо зовнішніх системних послуг",
           [type: :list, default: ["admin", "security_officer"]]}
        ]
      },
      %{
        id: "SA-22",
        name: "КОМПОНЕНТИ СИСТЕМИ, ЩО НЕ ПІДТРИМУЮТЬСЯ (SA-22)",
        text: "Інтеграція нових підсистем (SA) вимагає використання open-source компонентів та безкоштовного ПЗ, сумісного з мікросервісною архітектурою та стандартами ЄСІКС.",
        parameters: [
          {:sa_22_odp_01,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {внутрішня підтримка; підтримка від зовнішніх постачальників}",
           [type: :string, default: nil]}
        ]
      }
    ]
  },
  %{
    id: "SC",
    name: "ЗАХИСТ СИСТЕМ ТА КОМУНІКАЦІЙ (SC)",
    text: "Комунікації захищені TLS версії не нижче 1.3 на порту 443. Заборонено відкривати інші порти назовні. Взаємодія сервісів використовує брокери повідомлень та REST/RPC.",
    subcontrols: [
      %{
        id: "SC-1",
        name: "ПОЛІТИКА ТА ПРОЦЕДУРИ ЗАХИСТУ СИСТЕМИ ТА КОМУНІКАЦІЙ (SC-1)",
        text: "Комунікації захищені TLS версії не нижче 1.3 на порту 443. Заборонено відкривати інші порти назовні. Взаємодія сервісів використовує брокери повідомлень та REST/RPC.",
        parameters: [
          {:sc_1_odp_01,
           "Визначено персонал або ролі, до яких має бути доведена політика захисту системи та комунікацій",
           [type: :list, default: ["admin", "security_officer"]]},
          {:sc_1_odp_02,
           "Визначено персонал або ролі, на які поширюються процедури захисту системи та комунікацій",
           [type: :list, default: ["admin", "security_officer"]]},
          {:sc_1_odp_03,
           "Вибрано жодне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {рівень організації; рівень місії/бізнеспроцесу; рівень системи}",
           [type: :string, default: nil]},
          {:sc_1_odp_04,
           "Визначено посадову особу, яка керуватиме політикою та процедурами захисту системи та комунікацій",
           [type: :list, default: ["admin", "security_officer"]]},
          {:sc_1_odp_05,
           "Визначена періодичність перегляду та оновлення поточної політики захисту системи та комунікацій",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:sc_1_odp_06,
           "Є події, які вимагають перегляду та оновлення поточної політики захисту системи та комунікацій",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:sc_1_odp_07,
           "Визначена періодичність перегляду та оновлення поточних процедур захисту системи та засобів зв'язку",
           [type: :string, default: "щорічно"]}
        ]
      },
      %{
        id: "SC-4",
        name: "ІНФОРМАЦІЯ В ЗАГАЛЬНИХ СИСТЕМНИХ РЕСУРСАХ (SC-4)",
        text: "Erlang VM не використовує спільну пам'ять (shared memory) між процесами сесій N2O. Пам'ять звільняється автоматично (Garbage Collection) після обробки запиту, запобігаючи витоку залишкової інформації між різними користувачами.",
        parameters: [
          %{default: true, name: :shared_resource_protection, type: :boolean}
        ]
      },
      %{
        id: "SC-7",
        name: "ДОСТУПНІСТЬ РЕСУРСІВ (SC-7)",
        text: "Всі зовнішні підключення приймаються виключно через єдиний порт (керований інтерфейс), що обробляється веб-сервером (Cowboy). Доступ до внутрішніх API і вузлів кластера блокується правилами мережевого екранування за замовчуванням (Default Deny).",
        parameters: [
          %{default: true, name: :boundary_protection, type: :boolean}
        ]
      },
      %{
        id: "SC-7(5)",
        name: "ЗАХИСТ ПЕРИМЕТРА - ВІДМОВА ЗА ЗАМОВЧУВАННЯМ - ДОЗВІЛ ЗА ВИНЯТКОМ (SC-7(5))",
        text: "Комунікації захищені TLS версії не нижче 1.3 на порту 443. Заборонено відкривати інші порти назовні. Взаємодія сервісів використовує брокери повідомлень та REST/RPC.",
        parameters: []
      },
      %{
        id: "SC-8",
        name: "КОНФІДЕНЦІЙНІСТЬ ТА ЦІЛІСНІСТЬ ПЕРЕДАЧІ (SC-8)",
        text: "Передача інформації між клієнтом і сервером здійснюється виключно через зашифровані канали (WSS/TLS), що унеможливлює перехоплення (Man-in-the-Middle) або несанкціоновану модифікацію даних на льоту.",
        parameters: [
          %{default: true, name: :transmission_confidentiality, type: :boolean}
        ]
      },
      %{
        id: "SC-8(1)",
        name: "КОНФІДЕНЦІЙНІСТЬ ТА КРИПТОГРАФІЧНИЙ ЗАХИСТ (SC-8(1))",
        text: "Комунікації захищені TLS версії не нижче 1.3 на порту 443. Заборонено відкривати інші порти назовні. Взаємодія сервісів використовує брокери повідомлень та REST/RPC.",
        parameters: [
          {:sc_8_1_odp,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {запобігти несанкціонованому розголошенню інформації; виявити зміни в інформації}",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "SC-8(2)",
        name: "КОНФІДЕНЦІЙНІСТЬ ТА ЦІЛІСНІСТЬ ПЕРЕДАЧІ - ПОПЕРЕДНЯ І ПОСТОБРОБКА (SC-8(2))",
        text: "Комунікації захищені TLS версії не нижче 1.3 на порту 443. Заборонено відкривати інші порти назовні. Взаємодія сервісів використовує брокери повідомлень та REST/RPC.",
        parameters: [
          {:sc_8_2_01,
           "КОНФІДЕНЦІЙНІСТЬ ТА ЦІЛІСНІСТЬ ПЕРЕДАЧІ - ПОПЕРЕДНЯ І ПОСТОБРОБКА МЕТА ОЦІНКИ: Визначити, чи:",
           [type: :string, default: nil]},
          {:sc_8_2_odp,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {конфіденційність; цілісність}",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "SC-10",
        name: "ВІДКЛЮЧЕННЯ МЕРЕЖІ (SC-10)",
        text: "Протокол N2O автоматично розриває мережеве з'єднання після завершення комунікаційного сеансу або перевищення часу очікування (Inactivity Timeout), звільняючи ресурси та сесію.",
        parameters: [
          %{default: 3600, name: :network_disconnect_timeout, type: :integer}
        ]
      },
      %{
        id: "SC-12",
        name: "ВСТАНОВЛЕННЯ КЛЮЧАМИ (SC-12)",
        text: "Керування ключами та сертифікатами для встановлення захищених з'єднань делегується бібліотеці `synrc/ca` та інтегрованим механізмам TLS ОС, що відповідають чинним криптографічним стандартам.",
        parameters: [
          %{default: true, name: :cryptographic_key_management, type: :boolean}
        ]
      },
      %{
        id: "SC-13",
        name: "КРИПТОГРАФІЧНИЙ ЗАХИСТ (SC-13)",
        text: "Система підтримує використання схвалених криптографічних алгоритмів (AES-GCM, SHA-256/512, ДСТУ 4145-2002 через відповідні модулі), які забезпечують необхідний рівень стійкості.",
        parameters: [
          %{default: true, name: :cryptographic_protection, type: :boolean}
        ]
      },
      %{
        id: "SC-15",
        name: "СПІЛЬНІ ОБЧИСЛЮВАЛЬНІ ПРИСТРОЇ ТА ЗАСТОСУНКИ (SC-15)",
        text: "Комунікації захищені TLS версії не нижче 1.3 на порту 443. Заборонено відкривати інші порти назовні. Взаємодія сервісів використовує брокери повідомлень та REST/RPC.",
        parameters: []
      },
      %{
        id: "SC-17",
        name: "СЕРТИФІКАТИ ІНФРАСТРУКТУРИ ВІДКРИТИХ КЛЮЧІВ (SC-17)",
        text: "Комунікації захищені TLS версії не нижче 1.3 на порту 443. Заборонено відкривати інші порти назовні. Взаємодія сервісів використовує брокери повідомлень та REST/RPC.",
        parameters: []
      },
      %{
        id: "SC-18",
        name: "МОБІЛЬНИЙ КОД (SC-18)",
        text: "a. Визначати прийнятні та неприйнятні мобільні коди та технології мобільних кодів.\nb. Проводити авторизацію, відстежувати та контролювати використання мобільного коду всередині системи.",
        parameters: []
      },
      %{
        id: "SC-23",
        name: "АВТЕНТИФІКАЦІЯ СЕСІЇ (SC-23)",
        text: "Автентичність WebSocket-сесій N2O захищається токенами з криптографічним підписом (HMAC). Це гарантує, що повідомлення в рамках сесії не можуть бути підроблені або інжектовані сторонньою особою.",
        parameters: [
          %{default: true, name: :session_authenticity, type: :boolean}
        ]
      },
      %{
        id: "SC-28",
        name: "ЗАХИСТ ІНФОРМАЦІЇ В СТАНІ СПОКОЮ (SC-28)",
        text: "Комунікації захищені TLS версії не нижче 1.3 на порту 443. Заборонено відкривати інші порти назовні. Взаємодія сервісів використовує брокери повідомлень та REST/RPC.",
        parameters: [
          {:sc_28_odp,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {конфіденційність; цілісність}",
           [type: :string, default: nil]},
          {:sc_28_odp_02,
           "Є інформація в стані спокою, яка потребує захисту",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "SC-28(1)",
        name: "ЗАХИСТ ІНФОРМАЦІЇ В СТАНІ СПОКОЮ | КРИПТОГРАФІЧНИЙ ЗАХИСТ",
        text: "Комунікації захищені TLS версії не нижче 1.3 на порту 443. Заборонено відкривати інші порти назовні. Взаємодія сервісів використовує брокери повідомлень та REST/RPC.",
        parameters: [
          {:sc_28_1_01,
           "Реалізовані криптографічні механізми для запобігання несанкціонованому розкриттю інформації, що знаходиться в стані спокою на системних компонентах або носіях",
           [type: :string, default: "AES-256-GCM"]},
          {:sc_28_1_02,
           "Реалізовані криптографічні механізми для запобігання несанкціонованій модифікації інформації, що знаходиться в стані спокою на системних компонентах або носіях",
           [type: :string, default: "AES-256-GCM"]}
        ]
      },
      %{
        id: "SC-44",
        name: "ЕКРАНОВАНІ КАМЕРИ (SC-44)",
        text: "Комунікації захищені TLS версії не нижче 1.3 на порту 443. Заборонено відкривати інші порти назовні. Взаємодія сервісів використовує брокери повідомлень та REST/RPC.",
        parameters: [
          {:sc_44_01,
           "Використовується в системі <SC-44_ODP, компоненті або місці розташування> застосування екранованої камери системному можливість",
           [type: :string, default: nil]},
          {:sc_44_odp,
           "Визначена система, компонент системи або місце, де має бути застосований потенціал екранованої камери",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "SC-49",
        name: "ПРИМУСОВЕ АПАРАТНЕ ЗАБЕЗПЕЧЕННЯ ВИКОНАННЯ (SC-49)",
        text: "Комунікації захищені TLS версії не нижче 1.3 на порту 443. Заборонено відкривати інші порти назовні. Взаємодія сервісів використовує брокери повідомлень та REST/RPC.",
        parameters: [
          {:sc_49_01,
           "Впроваджено механізми апаратного розділення та застосування політик між доменами безпеки",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:sc_49_odp,
           "Визначені домени безпеки, які потребують апаратного розділення та механізмів забезпечення дотримання політики",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]}
        ]
      },
      %{
        id: "SC-51",
        name: "АПАРАТНИЙ ЗАХИСТ (SC-51)",
        text: "Комунікації захищені TLS версії не нижче 1.3 на порту 443. Заборонено відкривати інші порти назовні. Взаємодія сервісів використовує брокери повідомлень та REST/RPC.",
        parameters: [
          {:sc_51_odp_01,
           "Визначено компоненти системної прошивки, потребують апаратного захисту від запису; які",
           [type: :string, default: nil]},
          {:sc_51_odp_02,
           "Визначені уповноважені особи, які повинні виконувати процедури вимкнення та повторного ввімкнення апаратного захисту від запису; SC-51a. використовується апаратний захист від запису для компонентів мікропрограми системи; SC-51b.[01] впроваджено спеціальні процедури для уповноважених осіб для ручного вимкнення апаратного захисту від запису для модифікацій мікропрограми; SC-51b.[02] реалізовано спеціальні процедури для уповноважених осіб для повторного увімкнення захисту від запису перед поверненням до робочого режиму",
           [type: :list, default: ["admin", "security_officer"]]}
        ]
      }
    ]
  },
  %{
    id: "SI",
    name: "ЦІЛІСНІСТЬ СИСТЕМИ ТА ІНФОРМАЦІЇ (SI)",
    text: "Цілісність даних забезпечується захистом від SQL та XSS ін'єкцій, екрануванням спецсимволів, валідацією JSON Schema та імутабельністю історичних даних (HL7, BPMN).",
    subcontrols: [
      %{
        id: "SI-1",
        name: "ПОЛІТИКА І ПРОЦЕДУРИ ЦІЛІСНОСТІ ІНФОРМАЦІЇ (SI-1)",
        text: "Цілісність даних забезпечується захистом від SQL та XSS ін'єкцій, екрануванням спецсимволів, валідацією JSON Schema та імутабельністю історичних даних (HL7, BPMN).",
        parameters: [
          {:si_1_odp_01,
           "Визначено персонал або ролі, до яких має бути доведена політика цілісності системи та інформації",
           [type: :list, default: ["admin", "security_officer"]]},
          {:si_1_odp_02,
           "Визначено персонал або ролі, на які поширюються процедури цілісності системи та інформації ",
           [type: :list, default: ["admin", "security_officer"]]},
          {:si_1_odp_03,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {рівень організації; рівень місії/бізнеспроцесу; рівень системи}",
           [type: :string, default: nil]},
          {:si_1_odp_04,
           "Визначено посадову особу, відповідальну за управління системою та політикою і процедурами цілісності інформації",
           [type: :list, default: ["admin", "security_officer"]]},
          {:si_1_odp_05,
           "Визначено періодичність перегляду та оновлення поточної політики цілісності системи та інформації",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:si_1_odp_06,
           "Є події, які вимагають перегляду та оновлення поточної політики цілісності системи та інформації",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:si_1_odp_07,
           "Визначено частоту, з якою переглядаються та оновлюються поточні цілісності системи та інформації",
           [type: :integer, default: 30]}
        ]
      },
      %{
        id: "SI-2",
        name: "ВИПРАВЛЕННЯ ДЕФЕКТІВ (SI-2)",
        text: "Цілісність даних забезпечується захистом від SQL та XSS ін'єкцій, екрануванням спецсимволів, валідацією JSON Schema та імутабельністю історичних даних (HL7, BPMN).",
        parameters: [
          {:si_2_odp,
           "Визначено період часу, протягом якого необхідно встановити оновлення програмного забезпечення, пов'язані з безпекою, після виходу оновлень; SI-02a.[01] виявлено недоліки системи; SI-02a.[02] повідомляється про недоліки системи; SI-02a.[03] виправлені недоліки системи; SI-02b.[01] перевіряються оновлення програмного забезпечення, пов'язані з усуненням недоліків, на ефективність перед встановленням; SI-02b.[02] перевіряються оновлення програмного забезпечення, пов'язані з виправленням дефектів, на наявність потенційних побічних ефектів перед встановленням; SI-02b.[03] перевіряються оновлення прошивки, пов'язані з усуненням недоліків, на ефективність перед встановленням; SI-02b.[04] перевіряються оновлення прошивки, пов'язані з усуненням недоліків, на наявність потенційних побічних ефектів перед встановленням; SI-02c.[01] встановлено оновлення програмного забезпечення, що стосуються безпеки, протягом часовий проміжок з моменту випуску оновлень; SI-02c.[02] встановлено оновлення мікропрограми, що стосуються безпеки, протягом часового періоду з моменту випуску оновлень; SI-02d. включено відновлення порушених прав у процес управління організаційною конфігурацією",
           [type: :integer, default: 30]}
        ]
      },
      %{
        id: "SI-3",
        name: "ЗАХИСТ ВІД ШКІДЛИВОГО КОДУ (SI-3)",
        text: "Цілісність даних забезпечується захистом від SQL та XSS ін'єкцій, екрануванням спецсимволів, валідацією JSON Schema та імутабельністю історичних даних (HL7, BPMN).",
        parameters: [
          {:si_3_odp_01,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {підписаний; непідписаний}",
           [type: :string, default: nil]},
          {:si_3_odp_02,
           "Визначено частоту, з якою механізми шкідливого коду виконують сканування",
           [type: :integer, default: 30]},
          {:si_3_odp_03,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {кінцева точка; точки входу та виходу з мережі}",
           [type: :string, default: nil]},
          {:si_3_odp_04,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {block malicious code; quarantitne malicious code; take action}",
           [type: :string, default: nil]},
          {:si_3_odp_05,
           "Визначено дії, яких слід вжити у відповідь на виявлення шкідливого коду (якщо вибрано)",
           [type: :list, default: ["login", "logout", "failed_attempt"]]}
        ]
      },
      %{
        id: "SI-4",
        name: "МОНІТОРИНГ СИСТЕМИ (SI-4)",
        text: "Цілісність даних забезпечується захистом від SQL та XSS ін'єкцій, екрануванням спецсимволів, валідацією JSON Schema та імутабельністю історичних даних (HL7, BPMN).",
        parameters: [
          {:si_4_odp_02,
           "Визначені методи та способи, що використовуються для виявлення несанкціонованого використання системи",
           [type: :list, default: ["admin", "security_officer"]]},
          {:si_4_odp_03,
           "Визначена інформація про моніторинг системи, яка повинна надаватися персоналу або ролям",
           [type: :list, default: ["admin", "security_officer"]]},
          {:si_4_odp_04,
           "Визначено персонал або ролі, яким має надаватися інформація про моніторинг системи",
           [type: :list, default: ["admin", "security_officer"]]},
          {:si_4_odp_05,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {за потребою; частота}",
           [type: :string, default: "щорічно"]}
        ]
      },
      %{
        id: "SI-4(4)",
        name: "МОНІТОРИНГ СИСТЕМИ КОМУНІКАЦІЙ (SI-4(4))",
        text: "Цілісність даних забезпечується захистом від SQL та XSS ін'єкцій, екрануванням спецсимволів, валідацією JSON Schema та імутабельністю історичних даних (HL7, BPMN).",
        parameters: [
          {:si_4_4_a_01,
           "Визначені критерії незвичної або несанкціонованої діяльності або умови для вхідного трафіку зв'язку",
           [type: :list, default: []]},
          {:si_4_4_a_02,
           "Визначені критерії незвичайної або несанкціонованої діяльності або умови для вихідного трафіку зв'язку",
           [type: :list, default: []]},
          {:si_4_4_b_01,
           "Здійснюється моніторинг вхідного комунікаційного трафіку частота на предмет незвичних або несанкціонованих дій або умов",
           [type: :string, default: "щорічно"]},
          {:si_4_4_b_02,
           "Контролюється вихідний трафік зв'язку частота на предмет незвичних або несанкціонованих дій або умов. вихідного виявлення",
           [type: :string, default: "щорічно"]}
        ]
      },
      %{
        id: "SI-5",
        name: "ПОПЕРЕДЖЕННЯ, РЕКОМЕНДАЦІЇ ТА ДИРЕКТИВИ З БЕЗПЕКИ (SI-5)",
        text: "Цілісність даних забезпечується захистом від SQL та XSS ін'єкцій, екрануванням спецсимволів, валідацією JSON Schema та імутабельністю історичних даних (HL7, BPMN).",
        parameters: [
          {:si_5_odp_01,
           "Визначені зовнішні організації, від яких необхідно постійно отримувати оповіщення, поради та директиви щодо безпеки системи",
           [type: :string, default: nil]},
          {:si_5_odp_02,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {персонал або ролі; елементи; зовнішні організації}",
           [type: :list, default: ["admin", "security_officer"]]},
          {:si_5_odp_03,
           "Визначено персонал або ролі, до яких мають бути доведені попередження, поради та директиви з безпеки (якщо визначено)",
           [type: :list, default: ["admin", "security_officer"]]},
          {:si_5_odp_04,
           "Визначені елементи в організації, до яких мають надсилатися оповіщення, поради та директиви з безпеки (якщо вони були обрані)",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "SI-7",
        name: "ЦІЛІСНІСТЬ ПРОГРАМНОГО ЗАБЕЗПЕЧЕННЯ, ПРОГРАМНОГО ЗАБЕЗПЕЧЕННЯ ТА ІНФОРМАЦІЇ (SI-7)",
        text: "Цілісність даних забезпечується захистом від SQL та XSS ін'єкцій, екрануванням спецсимволів, валідацією JSON Schema та імутабельністю історичних даних (HL7, BPMN).",
        parameters: [
          {:si_7_odp_01,
           "Визначено програмне забезпечення, яке потребує застосування засобів перевірки цілісності для виявлення несанкціонованих змін",
           [type: :string, default: nil]},
          {:si_7_odp_02,
           "Визначено прошивку, яка потребує застосування інструментів перевірки цілісності для виявлення несанкціонованих змін",
           [type: :string, default: nil]},
          {:si_7_odp_03,
           "Визначена інформація, яка потребує застосування засобів перевірки цілісності для виявлення несанкціонованих змін",
           [type: :string, default: nil]},
          {:si_7_odp_04,
           "Визначені дії, яких слід вжити при виявленні несанкціонованих змін у програмному забезпеченні",
           [type: :list, default: ["login", "logout", "failed_attempt"]]},
          {:si_7_odp_05,
           "Визначені дії, яких слід вжити несанкціонованих змін у прошивці; при виявленні SI-07_ODP[06] визначені дії, яких слід вжити несанкціонованих змін до інформації; при виявленні SI-07a.[01] використовуються засоби перевірки цілісності для виявлення несанкціонованих змін у програмному забезпеченні; SI-07a.[02] використовуються засоби перевірки цілісності для виявлення несанкціонованих змін у мікропрограмі; SI-07a.[03] використовуються засоби перевірки цілісності для виявлення несанкціонованих змін до інформації; SI-07b.[01] виконуються дії при виявленні несанкціонованих змін у програмному забезпеченні; SI-07b.[02] виконуються дії несанкціонованих змін у прошивці; при виявленні SI-07b.[03] виконуються дії несанкціонованих змін в інформації. при виявленні",
           [type: :list, default: ["login", "logout", "failed_attempt"]]}
        ]
      },
      %{
        id: "SI-12",
        name: "УПРАВЛІННЯ ТА ЗБЕРЕЖЕННЯ ІНФОРМАЦІЇ (SI-12)",
        text: "Цілісність даних забезпечується захистом від SQL та XSS ін'єкцій, екрануванням спецсимволів, валідацією JSON Schema та імутабельністю історичних даних (HL7, BPMN).",
        parameters: [
          {:si_12_01,
           "Здійснюється управління інформацією в системі відповідно до чинних законів, наказів, директив, положень, політик, стандартів, інструкцій та експлуатаційних вимог",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:si_12_02,
           "Зберігається інформація в системі відповідно до чинних законів, указів Президента, директив, положень, політик, стандартів, інструкцій та експлуатаційних вимог",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:si_12_03,
           "Управління інформацією, що виводиться з системи, здійснюється відповідно до чинних законів, указів Президента, директив, положень, політик, стандартів, інструкцій та операційних вимог",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:si_12_04,
           "Зберігається інформація, що виводиться з системи, відповідно до чинних законів, наказів, директив, положень, політик, стандартів, інструкцій та експлуатаційних вимог",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]}
        ]
      }
    ]
  },
  %{
    id: "SR",
    name: "УПРАВЛІННЯ РИЗИКАМИ В ЛАНЦЮГУ ПОСТАЧАННЯ (SR)",
    text: "Управління ризиками ланцюга постачання базується на перевірці бібліотек через exploit-db та обов'язковому оновленні вразливостей.",
    subcontrols: [
      %{
        id: "SR-1",
        name: "ПОЛІТИКА ТА ПРОЦЕДУРИ УПРАВЛІННЯ РИЗИКАМИ ЛАНЦЮГА ПОСТАЧАННЯ (SR-1)",
        text: "Управління ризиками ланцюга постачання базується на перевірці бібліотек через exploit-db та обов'язковому оновленні вразливостей.",
        parameters: [
          {:sr_1_odp_01,
           "Визначено персонал або ролі, на які поширюється політика управління ризиками ланцюга постачання",
           [type: :list, default: ["admin", "security_officer"]]},
          {:sr_1_odp_02,
           "Визначено персонал або ролі, на які поширюються процедури управління ризиками ланцюга постачання",
           [type: :list, default: ["admin", "security_officer"]]},
          {:sr_1_odp_03,
           "Вибрано одне або декілька з наступних ЗНАЧЕНЬ ПАРАМЕТРІВ: {рівень організації; рівень завдань/бізнеспроцесу; рівень системи}",
           [type: :string, default: nil]},
          {:sr_1_odp_04,
           "Визначена посадова особа, відповідальна за розробку, документування та розповсюдження політики та процедур управління ризиками ланцюга постачання",
           [type: :list, default: ["admin", "security_officer"]]},
          {:sr_1_odp_05,
           "Визначена періодичність перегляду та оновлення поточної політики управління ризиками ланцюга постачання",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:sr_1_odp_06,
           "Є події, які вимагають перегляду та оновлення поточної політики управління ризиками ланцюга постачання",
           [type: :list, default: ["default_deny_rule", "abac_rule_1"]]},
          {:sr_1_odp_07,
           "Визначена періодичність перегляду та оновлення поточної процедури управління ризиками ланцюга постачання",
           [type: :string, default: "щорічно"]}
        ]
      },
      %{
        id: "SR-2",
        name: "ПЛАН УПРАВЛІННЯ РИЗИКАМИ ЛАНЦЮГА ПОСТАЧАННЯ (SR-2)",
        text: "План управління базується на принципі відмови від стороннього коду. Замість інтеграції сотень неперевірених бібліотек, команда розробляє всі необхідні компоненти (веб-сервер N2O, KVS, CA) самостійно в єдиному монорепозиторії.",
        parameters: [
          %{default: true, name: :zero_dependency_policy, type: :boolean}
        ]
      },
      %{
        id: "SR-3",
        name: "КОНТРОЛЬ ЛАНЦЮГА ПОСТАЧАННЯ І ПРОЦЕСІВ (SR-3)",
        text: "Заборонено використання автоматичних менеджерів пакетів для завантаження коду під час збірки. Весь вихідний код системи та модулів міститься безпосередньо в репозиторії проекту, що гарантує 100% контроль над кожним рядком коду, який компілюється.",
        parameters: [
          %{default: true, name: :strict_code_vendoring, type: :boolean}
        ]
      },
      %{
        id: "SR-5",
        name: "СТРАТЕГІЇ ПРИДБАННЯ, ІНСТРУМЕНТИ І МЕТОДИ (SR-5)",
        text: "Управління ризиками ланцюга постачання базується на перевірці бібліотек через exploit-db та обов'язковому оновленні вразливостей.",
        parameters: [
          {:sr_5_01,
           "Застосовуються стратегії, інструменти та методи для захисту від ризиків ланцюга постачання",
           [type: :string, default: nil]},
          {:sr_5_02,
           "Застосовуються стратегії, інструменти та методи для виявлення ризиків ланцюга постачання",
           [type: :string, default: nil]},
          {:sr_5_03,
           "Застосовуються стратегії, інструменти та методи для зменшення ризиків ланцюга постачання",
           [type: :string, default: nil]},
          {:sr_5_odp,
           "Визначені стратегії закупівель, контрактні інструменти та методи закупівель для захисту, виявлення та пом'якшення ризиків ланцюга постачання",
           [type: :string, default: nil]}
        ]
      },
      %{
        id: "SR-6",
        name: "ОЦІНКА ПОСТАЧАЛЬНИКІВ (SR-6)",
        text: "Єдиним зовнішнім «постачальником» є розробник платформи Erlang/OTP (компанія Ericsson та спільнота). Оновлення версій OTP проходять жорстку перевірку перед їх застосуванням на продуктивних серверах.",
        parameters: [
          %{default: true, name: :erlang_otp_supplier_review, type: :boolean}
        ]
      }
    ]
  }
]
  end
end
